{
  "source": "ConvoKit Reddit Corpus (small)",
  "total_conversations": 91,
  "conversations": [
    {
      "id": "9c2pw8",
      "subreddit": "guns",
      "title": "Anyone feelin’ a little German today?",
      "messages": [
        {
          "sender": "sent",
          "text": "Took out the artillery Luger and the c96 broomhandle. The Luger worked flawlessly even though it’s 101 years but the broom handle spring doesn’t sit in the follower and the follower kept getting st..."
        },
        {
          "sender": "received",
          "text": "Hey there, your follower spring may be worn out. Wolff sells kits for them. You will need to fit the spring to get it in the floor plate notch. It's a little tedious. Or the spring isn't set in tha..."
        },
        {
          "sender": "sent",
          "text": "How much does one of those broom handle mausers sell for these days?"
        },
        {
          "sender": "received",
          "text": "Hunter S Thomson battle tested..."
        },
        {
          "sender": "sent",
          "text": "Jesus Christ. I’ve never seen that one before"
        },
        {
          "sender": "received",
          "text": "$700-$3500. They were made a while in various calibers. I did a P38 and serial matching P08 Luger last year (both 1943?). When I get the broomhandle, I'm done with German pistols."
        },
        {
          "sender": "sent",
          "text": "I don’t have any, but it’s on my dream list because of the Star Wars tie-in."
        },
        {
          "sender": "received",
          "text": "This is America ♪♫"
        },
        {
          "sender": "sent",
          "text": "It's on my dream list because it's the sidearm my grandfather would have carried in when he was fighting Mao's communist hordes in 1949."
        },
        {
          "sender": "received",
          "text": "Overpaid for mine, got an all original parts matching gun, but I shoot it so much that I should have just bought a mutt."
        },
        {
          "sender": "sent",
          "text": "If you find one for $700, you own a time machine because that was before the whole cod:ww2 surplus forgotten weapons craze."
        },
        {
          "sender": "received",
          "text": "I glanced on GunBroker to see if things had changed much in the last 9 months since I was shopping. I quickly found one for $1000 Prices might have gone up a bit. I bet you can find one for $700 if..."
        },
        {
          "sender": "sent",
          "text": "the biggest issue with broomhandles is bore condition. you can find cheap ones $500-800 but most will have a sewer pipe for a bore."
        },
        {
          "sender": "received",
          "text": "Is a sterling on that list as well then?"
        }
      ]
    },
    {
      "id": "9c3jon",
      "subreddit": "guns",
      "title": "Comparison tables of thin concealed carry pistols? Looking for thin",
      "messages": [
        {
          "sender": "sent",
          "text": "Christmas is coming. Sometimes she has to dress like a girl. Trying to find thin nearly invisible pistol. Without wading through lots of self-promoting articles and making spreadsheets. Suggestions..."
        },
        {
          "sender": "received",
          "text": "Ruger LCP II North American Arms makes some very small .22 and .22 magnum pistols, but they are PBR, last-ditch tools at best."
        },
        {
          "sender": "sent",
          "text": "I have handled these .22s, and while dangerous, I had serious doubts about even contact shots having immediate impact. The LCP was on my minimal list. Mixed feelings on .380. I sold mine. Felt wimp..."
        },
        {
          "sender": "received",
          "text": ".380 has a new trick. Lehigh solid copper bullets. I get mine loaded by underwood. Hot shit in a Champaign glass compared to other .380 defensive loading that are cold diarrhea in a Dixie cup by co..."
        },
        {
          "sender": "sent",
          "text": "&gt; I had serious doubts about even contact shots having immediate impact. What are you talking about??"
        },
        {
          "sender": "received",
          "text": "The LC9s pro or G43 would be my next choices. OP specifically mentioned .22s is the only reason I mentioned NAA."
        },
        {
          "sender": "sent",
          "text": "Aenemic .22 rounds."
        },
        {
          "sender": "received",
          "text": "Same with the .22s and NAA. Great minds."
        },
        {
          "sender": "sent",
          "text": "Glorified FMJ."
        },
        {
          "sender": "received",
          "text": "22lr is only moving 750ish fps out of a barrel that short. It's not a toy, but it certainly doesn't inspire much confidence as a defensive round either."
        },
        {
          "sender": "sent",
          "text": "Hang out on YouTube for a little bit and your mind will change. It’s a cool new thing for once. I went from pocket carrying a P32 on Buffalo Bore Heavy Hard Cast to an LCPII Underwood loaded Lehigh..."
        },
        {
          "sender": "received",
          "text": "Performs quite differently in gel."
        },
        {
          "sender": "sent",
          "text": "Sooo... Wound channel very slightly larger than FMJ and gross over penetration? Yeah no thanks, not impressed. I’ll stick to XTPs."
        },
        {
          "sender": "received",
          "text": "Paul Harrell has some videos on YouTube about the NAA revolvers. His conclusion is basically that they’re not ideal, but they really will get the job done if you have to use it."
        },
        {
          "sender": "sent",
          "text": "If muzzle in contact with target, still possibly insufficient."
        }
      ]
    },
    {
      "id": "9c8ft8",
      "subreddit": "guns",
      "title": "The SIG P365 still is NOT fixed, same issues the older models were having.",
      "messages": [
        {
          "sender": "sent",
          "text": "Sig released the \"third gen 365\" June 15th. After these were released, there have been NO reports or videos of any failures with this generation. For the last few weeks I've been bragging about my ..."
        },
        {
          "sender": "received",
          "text": "Surprise to no one, except those who keep defending it with “there’s always problems with first generation tech” or “its a youtuber anti-sig conspiracy!”."
        },
        {
          "sender": "sent",
          "text": "Well like I said, nobody has reported a single issue with the new ones. Most 365 owners thought they were fixed."
        },
        {
          "sender": "received",
          "text": "It's totally fair to give companies time to work out teething issues on new products, but this is just unacceptable. It's definitely not a surprise though."
        },
        {
          "sender": "sent",
          "text": "To be fair, initial releases often bring to light the issues and they get fixed. See the CZ p-10. If however you don't get it fixed after the first time, and then refuse to admit there's a problem,..."
        },
        {
          "sender": "received",
          "text": "Fuck that, that's what R&amp;D is for. This rolling shit out the door and using early adopters as defacto beta testers is bullshit. These aren't toys, people are potentially trusting their lives to..."
        },
        {
          "sender": "sent",
          "text": "Considering it's possibly a life saving tool, gun companies shouldn't push the R&amp;D/beta testing onto the consumer."
        },
        {
          "sender": "received",
          "text": "This is why I never bought an MCX, virtus, rattler, or MPX and never will."
        },
        {
          "sender": "sent",
          "text": "How the hell are these guys landing military contracts."
        },
        {
          "sender": "received",
          "text": "SIG undercut everyone else by a huge margin. Glock wasn't lying when they claimed their gun outperformed the P320 and that the SIG XM18 (compact) testing was cut short. The MHS trials were designed..."
        },
        {
          "sender": "sent",
          "text": "Time and again do I hear this fucking story with the military. Bradley, M14, M16.. It's gotten to the point where if the military adopts something I'm skeptical it's any good. At least for the firs..."
        },
        {
          "sender": "received",
          "text": "Oddly, isn't undercutting everyone else exactly how Glock got into ever cop's hand? But it's fucking Glock, so no one complains; any other company goes the same route and they're roasted."
        },
        {
          "sender": "sent",
          "text": "To my knowledge the M16 was more or less fine at the start, sure it had some issues with the flash hider and the handguards but it would have been a largely uneventful introduction if the Army hadn..."
        },
        {
          "sender": "received",
          "text": "No one complains because glock undercut but delivered on a reliable handgun."
        },
        {
          "sender": "sent",
          "text": "Resting on their laurels. And they'll keep doing it because they have the MHS contract."
        }
      ]
    },
    {
      "id": "9casd3",
      "subreddit": "guns",
      "title": "Make your own Ammo why or why not",
      "messages": [
        {
          "sender": "sent",
          "text": "I've just recently got into shooting and someone at the range suggesting making my own Ammo I was wondering what everyones thoughts on that were."
        },
        {
          "sender": "received",
          "text": "It's called reloading and it's worth it if you're either shooting a very large amount of ammo regularly or if you're shooting something that's expensive/uncommon."
        },
        {
          "sender": "sent",
          "text": "The ammo I shoot I wouldn't say expensive but it's about fifty cents a bullet. I would also assume that it may be cheaper to shove out a big initial and get more for the money even at the cost of l..."
        },
        {
          "sender": "received",
          "text": "What caliber are you shooting? R/gundeals Has some sweet deals on ammo. That might save you some cash."
        },
        {
          "sender": "sent",
          "text": ".40 s&amp;w"
        },
        {
          "sender": "received",
          "text": ".50 a round is expensive. 9mm can be under 0.18 a round if you buy in bulk. Get subscribed to"
        },
        {
          "sender": "sent",
          "text": "40 has been popping up on there relatively often recently."
        },
        {
          "sender": "received",
          "text": "I found it at a pawn shop for pretty cheap didn't think I'd like it as much , besides the shitty trigger."
        },
        {
          "sender": "sent",
          "text": "The other day there was a link on gundeals for 650 rounds of 40 s&amp;w for like 21 cpr. Got me some for the new 40 since all I had was 9"
        },
        {
          "sender": "received",
          "text": "Sweet Jesus you are overpaying for ammo. By almost double. Buy in bulk online. Either wikiarms.com (sort to exclude reloads or steel cases) or SGammo."
        },
        {
          "sender": "sent",
          "text": "Your upfront cost for a reloading setup is around $400-$500. Add to this, a workspace that if you're complaining about a college budget, you may not have the space to devote. Add in the time requir..."
        },
        {
          "sender": "received",
          "text": "If you're paying 50 cents a round for 40 s&amp;w, I'd recommend getting better at shopping first before worrying about reloading. [You can find that stuff for 20 cents per round all day,] ( and tha..."
        },
        {
          "sender": "sent",
          "text": "What have you done.? This kid is never going to save money now."
        },
        {
          "sender": "received",
          "text": "Something straight walled like .38 special/.357 magnum or .45 colt could probably be done with $200-$300 even."
        },
        {
          "sender": "sent",
          "text": "There's really no other way for me to ethically stick an American flag in the peehole of my capitalist boner, though."
        }
      ]
    },
    {
      "id": "9cdck2",
      "subreddit": "guns",
      "title": "Why is the MK17 SCAR Being Phased out by the Military?",
      "messages": [
        {
          "sender": "sent",
          "text": "I heard that the MK17 SCAR orders are being canceled and that they’re getting replaced by m4 sopmod, spr, etc style rifles. is there any reason the military is moving on from the MK17 SCAR?"
        },
        {
          "sender": "received",
          "text": "SCAR is pricey as a mother fuck, likely the prime reason."
        },
        {
          "sender": "sent",
          "text": "Nothing is too pricy on a government budget."
        },
        {
          "sender": "received",
          "text": "Not when a vendor says \"we can do the job for $X\" and ends up invoicing you \"$XXXX\""
        },
        {
          "sender": "sent",
          "text": "They spent over 1 trillion dollars on a single program... if the US government wants something, the price tag is irrelevant. Just watch some of House oversight committee or Senate budget hearings o..."
        },
        {
          "sender": "received",
          "text": "That's basically what happened to the M14. Springfield said they could churn them out for much cheaper than they actually invoiced the government for, and the program was shut down in part for that..."
        },
        {
          "sender": "sent",
          "text": "if you're talking about the f35 basically the entire world is pissed it cost so much so"
        },
        {
          "sender": "received",
          "text": "&gt;Just watch some of House oversight committee or Senate budget hearings on C-Span. That's seriously the best entertainment on YouTube. If it weren't so depressing, I'd watch it all the time. I g..."
        },
        {
          "sender": "sent",
          "text": "The M9 and P226 both passed the 1980's handgun trials. Guess which one was cheaper."
        },
        {
          "sender": "received",
          "text": "It's actually nowhere as expensive as its made out to be."
        },
        {
          "sender": "sent",
          "text": "Listening to p&amp;s, apparently scars only cost about $350 to make."
        },
        {
          "sender": "received",
          "text": "Government pays less but a civilian in Europe has to pay 4290 $ for this gun. And proprietary mags. I would like to have one but I think this special gun is way overpriced. So a no go for me person..."
        },
        {
          "sender": "sent",
          "text": "Massive programs across multiple states is one things. Small programs like the scar they nickle and dime the shit out of."
        },
        {
          "sender": "received",
          "text": "My father participated in those trials. According to him almost everyone preferred the P226, but then the M9 happened anyway lol."
        },
        {
          "sender": "sent",
          "text": "one and a half trillion dollars sounds pretty fucking expensive fam. especially for a project that was supposed to cost abt a third of that. one and a half trillion dollars is enough that we could ..."
        }
      ]
    },
    {
      "id": "9cgqv4",
      "subreddit": "guns",
      "title": "Over penetration concerns in an apartment style setting",
      "messages": [
        {
          "sender": "sent",
          "text": "223/556 with correct ammo tends to over penetrate less than handgun rounds"
        },
        {
          "sender": "received",
          "text": "Probably should've cleared up the fact I'm living in an apartment complex with \"no deadly weapon\" policy and I'm looking for something to just keep in my lockbox in my drawer"
        },
        {
          "sender": "sent",
          "text": "Well that doesn't sound all that legally binding"
        },
        {
          "sender": "received",
          "text": "I know several friends with stuff lying around in their apartment that could get them kicked (couple of machetes, some bows, etc)"
        },
        {
          "sender": "sent",
          "text": "The plan really is just to keep it in said lockbox and if they ask it'll end up being \"travel and birth documents\""
        },
        {
          "sender": "received",
          "text": "Still don't thing a clause saying you can't own \"deadly weapons\" would be legally binding in an actual eviction hearing"
        },
        {
          "sender": "sent",
          "text": "Any thing is a deadly weapon if you try hard enough!"
        },
        {
          "sender": "received",
          "text": "They have no right to come in your house and ask!"
        },
        {
          "sender": "sent",
          "text": "They have to do apartment inspections every so often to make sure that nothing's burnt down or been damaged irreversibly, but honestly I doubt they'll look through my drawers. I just think a rifle ..."
        },
        {
          "sender": "received",
          "text": "How do you cut food or tighten screws? A guy in Houston was killed with a TV, I'd miss having my TV. That's a hella policy. Not to make light of your unfortunate situation but rather the stupidity ..."
        },
        {
          "sender": "sent",
          "text": "For sure an illegal clause, they cant restrict your right to own a firearm. Not to mention I'd rather get evicted for defending myself than have family come clear the apartment after putting me in ..."
        },
        {
          "sender": "received",
          "text": "They have to inform you of the inspection and if they did look in anything you sue the fuck out of them."
        },
        {
          "sender": "sent",
          "text": "That's the plan 🤷🏼‍♂️. Honestly I already own an AR, I just want a simple pistol that won't over penetrate"
        },
        {
          "sender": "received",
          "text": "Just stick with the AR, maybe get a lockable cabinet if you're poor like me. The AR is your best bet for HD, just pick the right ammo and don't miss."
        }
      ]
    },
    {
      "id": "9cqryd",
      "subreddit": "guns",
      "title": "This was a candid photo. Pure joy.",
      "messages": [
        {
          "sender": "sent",
          "text": "I will straighten out a lot of these questions :) 1) Grip Pods are fine, and nice for new shooters who want to try shooting standing up or laying on a mat. Also their girth is perfect for sex. 2) I..."
        },
        {
          "sender": "received",
          "text": "&gt; 5) We were outdoors with a suppressed MP5 and a suppressed AR. It wasn’t loud at all, so ears were not a necessity, but we had them there in case they were wanted. At the risk of sounding prea..."
        },
        {
          "sender": "sent",
          "text": "Before I began regular service I was a reservist in the Armoured Corps for 3 years, in the bad times in UK mil - back before Afghan had really established in 2006 through 2008, and the Army was sti..."
        },
        {
          "sender": "received",
          "text": "That really didn't clear anything up for me."
        },
        {
          "sender": "sent",
          "text": "Before getting into nfa stuff, I did (and still do), lots of work in refineries/chem plants. I don't recall exact number but it was on the order of 80db average over an 8hr day warranted ear pro. W..."
        },
        {
          "sender": "received",
          "text": "Happily in a relationship with whom? Not your butthole, I hope. And more importantly, are you in a relationship and it is happily? Do you need us to send help? Blink once for yes, twice for no. Hus..."
        },
        {
          "sender": "sent",
          "text": "She looks exactly like a brunette version of a blonde I used to date."
        },
        {
          "sender": "received",
          "text": "\"8 hour day\" is the key words. If you hear a loud sound(with in reason) you shouldn't suffer permanent hearing loss."
        },
        {
          "sender": "sent",
          "text": "The way I look at it is you have an overall lifetime decibel counter....say 10,000,000. If you’re driving down the highway. With the music and the sound of the car it’s 100 decibels. In one hour yo..."
        },
        {
          "sender": "received",
          "text": "B.S. Suppressors can knock off 20-30 decibels off what it is usually 160-170 decibel sound level, enough to cause permanent hearing loss. Live and learn..."
        }
      ]
    },
    {
      "id": "9csbpd",
      "subreddit": "guns",
      "title": "[Der season] good enuff for papi, good enuff for me.",
      "messages": [
        {
          "sender": "sent",
          "text": "This obviously unstaged photo features my Winchester 1894 in 30-30 (dated 1908) and my Remington Autoloader (pre-“model 8”) in .35 Remington just chilling the last few weeks before deer season. Kee..."
        },
        {
          "sender": "received",
          "text": "How do you like the Remington in .35? I was looking at one a little while ago and thinking it might make a nice deer rifle for my (small) grandmother, but I have no experience with that gun or cart..."
        },
        {
          "sender": "sent",
          "text": "This reminds me I need to get tags for next week....and finally decide if I’m gonna break tradition and bring the AR-10 or stick with the lucky M77"
        },
        {
          "sender": "received",
          "text": "She’s better off with a .270, I have the .35 and it kicks kind of like a 12 gauge plus ammo can be hard to find sometimes. That and parts for it are a pain in the ass to find, it’s been a few years..."
        },
        {
          "sender": "sent",
          "text": ".35 Remington is not fucking around. I love my model eight but it is a stout round with a bunch of kick."
        },
        {
          "sender": "received",
          "text": "&gt; I was looking at one a little while ago and thinking it might make a nice deer rifle for my (small) .35 Rem is a nice round but the model 8 series kicks like hell. Unlike most autoloaders that..."
        },
        {
          "sender": "sent",
          "text": "The round isn't actually that powerful, shoot it out of a lever or pump gun. The model 8 just increases the recoil because you have the whole mass of the barrel shooting into your shoulder. I switc..."
        },
        {
          "sender": "received",
          "text": "Ahh, that’s a shame. It was a neat gun with a really nifty offset scope. Thanks for the heads up, I’ll leave her with her .270 BA then."
        },
        {
          "sender": "sent",
          "text": "&gt; It was a neat gun with a really nifty offset scope I mean just get it for yourself. It's a fun enough gun to play around with, just not good for that purpose."
        },
        {
          "sender": "received",
          "text": "I might at that."
        }
      ]
    },
    {
      "id": "9d32iz",
      "subreddit": "guns",
      "title": "Official Politics Thread 5 September 2018",
      "messages": [
        {
          "sender": "sent",
          "text": "I'll announce COTM later today. Have to do 4-10s this week, which blows. (At least when it's not your regular schedule) Fire away!"
        },
        {
          "sender": "received",
          "text": "So the Boston Police Chief reports his son to the FBI and they launch an undercover investigation. Part of the investigation they gave him 4 guns. It’s fucking Fast N Furious again."
        },
        {
          "sender": "sent",
          "text": "Why the hell would they give him guns?"
        },
        {
          "sender": "received",
          "text": "as someone else said in , the vast majority of these cases begin and end with the FBI. In many cases the alleged never even communicated with actual terrorists or collaborators. Sure they're still ..."
        },
        {
          "sender": "sent",
          "text": "this is why"
        },
        {
          "sender": "received",
          "text": "This is how the FBI works. Almost every single one of their domestic terrorism stops, they've provided and egged on the suspect at every turn. There are people who made extremist posts online only ..."
        },
        {
          "sender": "sent",
          "text": "Copying a post I just made: This is how the FBI works. Almost every single one of their domestic terrorism stops, they've provided and egged on the suspect at every turn. There are people who made ..."
        },
        {
          "sender": "received",
          "text": "That's fucking shameful"
        },
        {
          "sender": "sent",
          "text": "It's the Feds, I feel like that's kinda tautological"
        },
        {
          "sender": "received",
          "text": "Fair"
        },
        {
          "sender": "sent",
          "text": "Suppose the New Mexico camp is the same thing going on?"
        },
        {
          "sender": "received",
          "text": "I wouldn't be shocked to find that out, but from what little I've read on it so far, I don't think it seems to follow their typical modus operandi. I think that the NM camp was initially discovered..."
        },
        {
          "sender": "sent",
          "text": "From what I read the feds were observing it and were pretty pissed off at the local smokies. I'll see if I can find a source if you want one"
        },
        {
          "sender": "received",
          "text": "I'd be interested"
        }
      ]
    },
    {
      "id": "9daqkm",
      "subreddit": "guns",
      "title": "My two-tone nickel-plated Nazi-era P38",
      "messages": [
        {
          "sender": "sent",
          "text": "Alright, so your great-granpappy was a member of the ultra-elite 182nd OSS Army Marine Paratroopers, and was dropped right into Berlin, where he fought his way single handedly into the Fuherbunker ..."
        },
        {
          "sender": "received",
          "text": "His name? Albert Einstein."
        },
        {
          "sender": "sent",
          "text": "Personally led a one man raid to physically carry the German bomb to America."
        },
        {
          "sender": "received",
          "text": "Can you tell what the grip material is? Is it Bakelite?"
        },
        {
          "sender": "sent",
          "text": "Eh, I suppose messing up a '44 isn't as bad as a '43 or before. Late war ones have less quality."
        },
        {
          "sender": "received",
          "text": "Maybe check to see if it was ever used in a movie"
        },
        {
          "sender": "sent",
          "text": "To me, it looks like something a Mallory Archer type character would carry. I can hear her now: \"WOODHOUSE! bring me the P38, the nickled one. I need something that's classy but carries undertones ..."
        },
        {
          "sender": "received",
          "text": "This is too perfect"
        },
        {
          "sender": "sent",
          "text": "I would take it for a grand still, it’s beautiful take great care of it!"
        },
        {
          "sender": "received",
          "text": "I was wondering the same. Thing is... Bakelite is awfully hard to keep in good shape that long so I kind of doubt it."
        },
        {
          "sender": "sent",
          "text": "&gt; Bubba's Forgotten Weapons If you actually start that channel, I'll subscribe day one."
        }
      ]
    },
    {
      "id": "9dazou",
      "subreddit": "guns",
      "title": "Album showing Amazon recently hiding search results for gun accessories: anyone else having this problem did I make in on a list for somehow? Any guesses at the reason?",
      "messages": [
        {
          "sender": "sent",
          "text": "Wouldn’t surprise me, it’s beyond me why some people still use them at all. Use DuckDuckGo."
        },
        {
          "sender": "received",
          "text": "&gt; it’s beyond me why some people still use them at all. Use DuckDuckGo. ...DuckDuckGo is a search engine Amazon is a company that sells stuff... How much have you had to drink today?"
        },
        {
          "sender": "sent",
          "text": "Chrome is a browser. DuckDuckGo is a search engine. Amazon is a company that sells stuff. How much have YOU had to drink today?"
        },
        {
          "sender": "received",
          "text": "Search engine. Same shit. Totally different than a sales site."
        },
        {
          "sender": "sent",
          "text": "Not enough."
        },
        {
          "sender": "received",
          "text": "Google would never be in cahoots with like minded commies, nor interfere with search results by using inhibitive algorithms, right? Screw google and amazon. Buy directly from the manufacturer."
        },
        {
          "sender": "sent",
          "text": "Manufacturers can be in cahoots with commies too. Fuck everyone. Make all things yourself!"
        },
        {
          "sender": "received",
          "text": "That is apparent, I doubt most manufacturers of firearms and accessory makers fall under that category though, thankfully."
        }
      ]
    },
    {
      "id": "9dcqi0",
      "subreddit": "guns",
      "title": "Give me all the 9mm",
      "messages": [
        {
          "sender": "sent",
          "text": "Give me a reason not to buy it"
        },
        {
          "sender": "received",
          "text": "I legitimately can’t think of one. If you’re someone considering buying one, you know what to expect from it and it will be exactly that. Tried Ruger mags, Glock mags, multiple types of ammo, and n..."
        },
        {
          "sender": "sent",
          "text": "Damn you...."
        },
        {
          "sender": "received",
          "text": "Also has adjustable sights out of box witch is a huge plus for the price of the gun!"
        },
        {
          "sender": "sent",
          "text": "48 hours later Hey , look what I got!"
        },
        {
          "sender": "received",
          "text": "I've got one as well. It is excellent. There are only two short comings. Can't use it for trap and can't hunt at 150+yds."
        },
        {
          "sender": "sent",
          "text": "I don’t think you understand how accurate your statement is."
        },
        {
          "sender": "received",
          "text": "... Is your bank account a few hundred lighter already or in danger of being in the next 12 hours?"
        },
        {
          "sender": "sent",
          "text": "If not this week probably in another 2 weeks. Have to make sure the bills are paid and I’m not eating ramen for two weeks 😅"
        },
        {
          "sender": "received",
          "text": "LGS and cabelas both have them, cabelas is like 150 cheaper, and internet is 200 cheaper... so I’m going to try and talk LGS down"
        },
        {
          "sender": "sent",
          "text": "Lmao I know the feeling! Over here, a busted AC condenser took the place of a new 10/22 in this week's budget :("
        },
        {
          "sender": "received",
          "text": "I was torn between the pcc9 and the 10/22 myself. The 10/22 is cheaper, and the ammo. But I’m expecting more aftermarket for the pcc9, hopefully conversion kits, and 9mm is a little more versatile."
        },
        {
          "sender": "sent",
          "text": "I'm really liking 22lr a lot these days. I'm going to end up with 3 or 4 different ones before it's over. Haven't looked much into pistol caliber carbines."
        },
        {
          "sender": "received",
          "text": "So with 9mm you’re getting a little more range, can hunt slightly bigger animals, and can use it for personal defense. That being said you can hold like 5000 rounds of .22 lr in your pocket 😂"
        }
      ]
    },
    {
      "id": "9df4v9",
      "subreddit": "guns",
      "title": "Thickheaded Thursday 6 September 2018",
      "messages": [
        {
          "sender": "sent",
          "text": "Still feels like Tuesday, but I guess that's not all bad. Sort by new."
        },
        {
          "sender": "received",
          "text": "Filed paperwork 2 weeks ago for an FFL. I left my previous job (Arby's general manager lol), and went to work for my dad's boss running a Napa. Only reason I did was because he is bankrolling inven..."
        },
        {
          "sender": "sent",
          "text": "Wide range of ammo. I don’t mean just a bunch of different calibers, but different loading/brand options. I rarely get ammo in brick and mortar stores anymore because they have like 2 varieties for..."
        },
        {
          "sender": "received",
          "text": "1. Reasonable transfer fees, 2. Be able to source and find things I need. If I can find it online your only value to me is doing the transfer. You being able to gopher something for me has value. I..."
        },
        {
          "sender": "sent",
          "text": "Stocking interesting (and correctly labeled) surplus, or guns for sale on consignment. There’s a lot of great history you can stock in a store that not a lot of stores (in my area) do!"
        },
        {
          "sender": "received",
          "text": "Lots of used items - military and police surplus and older high quality guns like 3rd generation S&amp;W automatics and Colt/Ruger/S&amp;W wheel guns. For new stuff, I'd try to stock some guns that..."
        },
        {
          "sender": "sent",
          "text": "&gt; What do you like seeing in a gun store? I'll tell you what I don't like, and that's the shittiest selection of boutique AR parts that nobody will ever fucking want. One shop near me has only B..."
        },
        {
          "sender": "received",
          "text": "Hell, my FFL has a Napa as his main business. I don't think he sells many guns but he does a shit load of transfers."
        },
        {
          "sender": "sent",
          "text": "Are you saying a standard milspec charging handle that has the Black Rain logo on it is only $30??"
        },
        {
          "sender": "received",
          "text": "No, MSRP is actually $35."
        },
        {
          "sender": "sent",
          "text": "I plan to keep a couple boxes of higher end things across a ton of calibers just to have some availability for testing purposes. If someone wants to try a box of Black Hills .223 I can get them a c..."
        },
        {
          "sender": "received",
          "text": "I am the go to on the NAPA end for guys wanting goofy hard to find stuff, same for gun parts thus far. I love finding weird little parts to fix old beaters. Good way to learn a lot as well. All abo..."
        },
        {
          "sender": "sent",
          "text": "I'm into this to spread the hobby and teach people; anything I can pick up by playing with some old milsurps and historical firearms I will be happy with. I love getting to show off my Garand and A..."
        },
        {
          "sender": "received",
          "text": "I know full and well I can dominate the lone gun shop in town by a landslide with inventory, knowledge, and friendliness I can't touch the biggest competitor, ever. Store/warehouse is maybe 25 minu..."
        },
        {
          "sender": "sent",
          "text": "Sounds like you're in a good place to carve out a niche for yourself. I think less common new stuff and the anything used and interesting is a good way to draw in customers from the megastore, but ..."
        }
      ]
    },
    {
      "id": "9djnav",
      "subreddit": "guns",
      "title": "My Mossberg 590A1",
      "messages": [
        {
          "sender": "sent",
          "text": "Mossberg 590A1 Magpul furniture including angled foregrip. Attached M9 bayonet. * Ghost ring sights. MOSSBERG 590 &gt; REMINGTON 870"
        },
        {
          "sender": "received",
          "text": "What ghost ring sights do you have?"
        },
        {
          "sender": "sent",
          "text": "870 &gt; 590 It’s in the numbers. Édit: Which sore person downvoted this? Buy your f’ing fudd gun and move on."
        },
        {
          "sender": "received",
          "text": "590 &gt; rust Jk, they’re both great platforms for their own reasons, neither is flat out “better.” They’re tools for their own purposes."
        },
        {
          "sender": "sent",
          "text": "Pick a side, damnit. We can't have reason and tolerance tainting our views around here!"
        },
        {
          "sender": "received",
          "text": "I believe those are simply the XS ghost ring sights that come standard on the 590A1 magpul version. I'm pretty sure the XS ghost ring sights for the 590 have the protective wings on the rear sights..."
        },
        {
          "sender": "sent",
          "text": "You can put a bayonet on both I think."
        },
        {
          "sender": "received",
          "text": "Anything is possible with enough duct tape and motivation."
        },
        {
          "sender": "sent",
          "text": "You are correct. That is our rail/ghost ring set up for that gun. We also have a set that fits many Mossbergs without a front ramp (though you'll need to measure your barrel). It's very similar to ..."
        },
        {
          "sender": "received",
          "text": "Mossberg's shell elevator being up and out of the way for reloads is a much better design."
        },
        {
          "sender": "sent",
          "text": "I’m not familiar with the difference, I just have a mossberg. How does the 870 do it?"
        },
        {
          "sender": "received",
          "text": "The shell elevator on the 870 rests in the lowered position. You have to push it up with each shell you load - which is easy, but when you are wearing gloves it will pinch your glove frustratingly ..."
        },
        {
          "sender": "sent",
          "text": "Do you have a model number for the front sight that comes standard with the 590a1? I'm trying to find a replacement."
        }
      ]
    },
    {
      "id": "9dpfbn",
      "subreddit": "guns",
      "title": "I built a custom rifle for my girlfriend",
      "messages": [
        {
          "sender": "sent",
          "text": "Damn, now I want a white AR."
        },
        {
          "sender": "received",
          "text": "Yes. I plan to build another (mostly) white one for myself. 1) Considering how popular FDE is these days with north American shooters, it’s slightly odd because it doesn’t match much of the geograp..."
        },
        {
          "sender": "sent",
          "text": "&gt; As a progressive, I see it as my duty to call my friends out on their quixotic views regarding ergonomics and aesthetic vs function. As a progressive, I throw up in my mouth a little when prog..."
        },
        {
          "sender": "received",
          "text": "FDE match's a lot of the geography of the USA and the world. It may not be ideal for specific applications but generally it's better than all black. Most of nature is a mix of brown and green with ..."
        },
        {
          "sender": "sent",
          "text": "Lol. I’ll credit you that, it does sound a bit like a post"
        },
        {
          "sender": "received",
          "text": "Progressive + quixotic + ergonomics + aesthetics in one sentence is more like"
        },
        {
          "sender": "sent",
          "text": "The entire I-10 corridor from Texas to California, then north to Nevada and Utah is FDE - like 1/5th the country."
        },
        {
          "sender": "received",
          "text": "I’m an engineer and I work with an industrial designer right across from me. The latter 2 are really common words when I talk with him Yeah I was having a tough time thinking of a better word than ..."
        },
        {
          "sender": "sent",
          "text": "Makes sense. I am the CIO of an information security company. I refer to my weapons as “end point protection,” body armor plate carrier as a “robust firewall,” and my gunsafe contents are “encrypte..."
        },
        {
          "sender": "received",
          "text": "I'm so sick of FDE. It's literally beige. There's a reason we stopped making beige computers. Beige sucks."
        },
        {
          "sender": "sent",
          "text": "Some parts of the Southwest, and... where? Most of the US is some shade of green. OD Green works well in most places."
        },
        {
          "sender": "received",
          "text": "My gun safe only accepts TLS 1.3"
        },
        {
          "sender": "sent",
          "text": "Have you ever walked through a northern forest from October to March the green changes and falls to the ground. Most of the great plains States from Texas to North Dakota are some kind of brown or ..."
        },
        {
          "sender": "received",
          "text": "You can say the same about i80 West of the Mississippi"
        }
      ]
    },
    {
      "id": "9dqgeb",
      "subreddit": "guns",
      "title": "Official Politics Thread 7 September 2018",
      "messages": [
        {
          "sender": "sent",
          "text": "Sorry this is a little early. Forgot to get the COTM for August. That goes to for keeping us updated on Illinois. Fire away!"
        },
        {
          "sender": "received",
          "text": "If you care about the future of firearms ownership in this country, do your part to take someone shooting who has never been before. Bonus points if it's someone who is currently infringe-y in thei..."
        },
        {
          "sender": "sent",
          "text": "&gt;I will never take a libtard shooting. Childish bullshit like this doesn't help. If we truly want to advance the cause of gun rights we need to educate and include. Most anti folks are afraid of..."
        },
        {
          "sender": "received",
          "text": "Honest question: Are you here to farm down votes or make the gun community look like shit?"
        },
        {
          "sender": "sent",
          "text": "Yet you never do and only troll"
        },
        {
          "sender": "received",
          "text": "I genuinely wish we could just ban him. He doesn't actually contribute anything."
        },
        {
          "sender": "sent",
          "text": "People like you give us all a bad name."
        },
        {
          "sender": "received",
          "text": "But then I'd be silencing conservative voices!"
        },
        {
          "sender": "sent",
          "text": "Just give me the banhammer and look the other way, it'll just take a minute"
        },
        {
          "sender": "received",
          "text": "The majority of your comments seem to have the goal of antagonizing other users."
        },
        {
          "sender": "sent",
          "text": "To anybody unfamiliar, this is at least the second time this guy has replied exactly this phrase in a Politics thread; he's just trolling for attention. At this point he's already been rebuked, so ..."
        }
      ]
    },
    {
      "id": "9duamj",
      "subreddit": "guns",
      "title": "First time target shooting in 10 years and I absolutely nailed it.",
      "messages": [
        {
          "sender": "sent",
          "text": "A 10cm target at 25m with a single shot bolt action .22 with iron sights (I don't know the model). I fired 4 shots. Might not be super impressive, but I was ecstatic."
        },
        {
          "sender": "received",
          "text": "Standing?"
        },
        {
          "sender": "sent",
          "text": "Crouched. This was my standing attempt, I only fired 3 rounds here, all hit, but no bullseye"
        },
        {
          "sender": "received",
          "text": "That grouping is impressive!"
        },
        {
          "sender": "sent",
          "text": "&gt; no bullseye Still would've been a bad day for the recipient. Cheers."
        },
        {
          "sender": "received",
          "text": "Cheers dude, I was pretty proud of it as well"
        },
        {
          "sender": "sent",
          "text": "Target shooting isn't about a \"recipient\"."
        },
        {
          "sender": "received",
          "text": "All shooting is, the target just happens to be the recipient."
        },
        {
          "sender": "sent",
          "text": "Yes, that target had such a \"bad day\"... ??"
        },
        {
          "sender": "received",
          "text": "It's symantics really. The target happens to be paper instead of an animal or person that's all. You can draw parallels right? If this was one's torso that person would have a bad day."
        },
        {
          "sender": "sent",
          "text": "Here was my first attempt with the second rifle For some reason the rifles were sighted differently, both off slightly in different ways, though they were the same model. Here is my second attempt ..."
        },
        {
          "sender": "received",
          "text": "My point was that it's weird to feel the need to immediately link bullseye target shooting to defensive shooting or hunting. The entire world doesn't revolve around killing things, you know."
        },
        {
          "sender": "sent",
          "text": "You're right there, I see your point about not only killing but that's what the original commentor you responded to was referring to. Being obtuse about their original post doesn't make you correct."
        },
        {
          "sender": "received",
          "text": "Cm? m? You're not in the US, are you?"
        }
      ]
    },
    {
      "id": "9dvyla",
      "subreddit": "guns",
      "title": "When did the terms \"pistol\" and \"revolver\" become separated in history?",
      "messages": [
        {
          "sender": "sent",
          "text": "Got a question for firearms history buffs. If the word \"pistol\" dates back to the 16th century, was it ever used for older firearms?"
        },
        {
          "sender": "received",
          "text": "A revolver is a pistol, its just a certain kind of pistol. Like how a ruben is a sandwich, but not every sandwich is a ruben."
        },
        {
          "sender": "sent",
          "text": "I think handgun is the word you're looking for, not pistol. I'm pretty sure a pistol needs to have the chamber integrated with the barrel, as opposed to a revolver where it is separate."
        },
        {
          "sender": "received",
          "text": "&gt; not every sandwich is a ruben. But they should be"
        },
        {
          "sender": "sent",
          "text": "Wait, then why were service revolvers like the Webley called pistols? Hmm, this sounds like a weekend research project. Edit revolvers not revilvers, idk how my phone autocowrecked that."
        },
        {
          "sender": "received",
          "text": "Same reason FN calls the SCAR-17 an \"assault rifle\": they're wrong. Government and even manufacturers don't always used correct technical terminology."
        },
        {
          "sender": "sent",
          "text": "Probably because guns are a highly politicized topic and everyone has a vested interest in defining and redefining terms, with two scoops of lawyer double talk on top. \"semi-automatics\" used to jus..."
        },
        {
          "sender": "received",
          "text": "Like you can turn your back on the Bánh mì."
        },
        {
          "sender": "sent",
          "text": "I am not good with tough decisions like this"
        },
        {
          "sender": "received",
          "text": "Handgun came later. I feel like pistol came from French or Italian. In Polish all handguns are called pistolet."
        }
      ]
    },
    {
      "id": "9dys6h",
      "subreddit": "guns",
      "title": "Anyone know where I can find a slide stop for a Star Model B?",
      "messages": [
        {
          "sender": "sent",
          "text": "So some time ago, my uncle gave me a Star Model B that was given to him as payment for some ranch work. The only problem was that the previous owner lost the slide stop somewhere and thought that i..."
        },
        {
          "sender": "received",
          "text": "Is this what you need?"
        },
        {
          "sender": "sent",
          "text": "Yeah, but for the B model"
        },
        {
          "sender": "received",
          "text": "Missed that. Out of stock. Check back later."
        },
        {
          "sender": "sent",
          "text": "Yeah, it’s like that everywhere"
        },
        {
          "sender": "received",
          "text": "How about this?"
        },
        {
          "sender": "sent",
          "text": "That’s for a BM, don’t think it would work"
        },
        {
          "sender": "received",
          "text": "Is there a BM? Numrich says the one that is out of stock fits SUPER A, SUPER B, SUPER M, SUPER P. I didn't know they made so many Stars. You might ask the seller about that. Either way good luck wi..."
        },
        {
          "sender": "sent",
          "text": "The way I understand it was that the slide stops for the BM won’t fit the super B which is what I think it is. Thanks for the help though"
        },
        {
          "sender": "received",
          "text": "The BM is the compact model. Looking at both the slide stop probably isn't interchangeable."
        },
        {
          "sender": "sent",
          "text": "Also, anything that fits the Super B is always out of stock indefinitely"
        }
      ]
    },
    {
      "id": "9e1w7p",
      "subreddit": "guns",
      "title": "Will the US army sell it's M92s?",
      "messages": [
        {
          "sender": "sent",
          "text": "So you have probably heard that the army is replacing it's Beretta M92s with Sig P320s. What are the chances they will sell some of their used M92s on the civilian market? What happened to all the ..."
        },
        {
          "sender": "received",
          "text": "It'll be a very long time before the M9s currently in service are released for sale to the public. Yes, the the military is phasing them out in favor of the SIGs, but the operative part of that sen..."
        },
        {
          "sender": "sent",
          "text": "Not to mention the Marine Corps probably has first dibs on all the hand-me-down M9s since they haven't gone to the Sig."
        },
        {
          "sender": "received",
          "text": "The Marines are going to Sig."
        },
        {
          "sender": "sent",
          "text": "WHAT!"
        },
        {
          "sender": "received",
          "text": "Yeah. Why wouldn't they."
        },
        {
          "sender": "sent",
          "text": "Because why adopt something new when the Army has all these lovely hand-me-downs? Is that not official doctrine?"
        },
        {
          "sender": "received",
          "text": "What? Where did you get the idea that it's official doctrine from."
        },
        {
          "sender": "sent",
          "text": "From being in the Marines..."
        },
        {
          "sender": "received",
          "text": "He's being (mostly) sarcastic. And more importantly, that IS typically how the corps operates. Hence why many marine units are STILL using m16a2s, despite official adoption of the m4 (years and yea..."
        },
        {
          "sender": "sent",
          "text": "I didn't realize all the M16A4s, M27s, the digital camo. All the body armor system. Were army handdowns,"
        },
        {
          "sender": "received",
          "text": "Not to mention that unlike the last time, we're not changing calibers. The Army is likely to hold onto the M9 until the numbers of M17s in reserve stock is equalish to the number of M9s. Hell, they..."
        },
        {
          "sender": "sent",
          "text": "Lmao, you actually think because something is adopted it's immediately implemented to every unit? It's not even given to MOST of them. Almost nobody has M27s yet, most of the body armor is hand-me-..."
        },
        {
          "sender": "received",
          "text": "Marines aren't allowed to touch the shiny things, they might eat them. The steel handguns would deter them but they're afraid marines might eat the plastic. This is also why they're still careful a..."
        }
      ]
    },
    {
      "id": "9e9hab",
      "subreddit": "guns",
      "title": "Brother-in-Law’s Smith &amp; Wesson straight out of Call of Duty",
      "messages": [
        {
          "sender": "sent",
          "text": "Get your finger off the trigger."
        },
        {
          "sender": "received",
          "text": "I’m innocent! It wasn’t me holding it! Honest question: Are you not supposed to touch the tigger even if it’s not loaded?"
        },
        {
          "sender": "sent",
          "text": "And out of the trigger guard."
        },
        {
          "sender": "received",
          "text": "Keep your booger hook off the bang switch until it’s time to make noise."
        },
        {
          "sender": "sent",
          "text": "Yes. Every gun should be treated as loaded, even if its unloaded."
        },
        {
          "sender": "received",
          "text": "Training- Purposefully pulling the trigger, dry firing in a safe direction after clearing a weapon no less than three times is very different than posing for a photo."
        },
        {
          "sender": "sent",
          "text": "Yes, if for any other reason than that it’s good habitual reinforcement to always have finger off the trigger until ready to fire."
        },
        {
          "sender": "received",
          "text": "Well you see, thats the thing about responsible gun ownership: you never assume anything. All it takes is once"
        },
        {
          "sender": "sent",
          "text": "Stop making good points, can’t you see this poor schmuck is trying to pick an internet fight?"
        },
        {
          "sender": "received",
          "text": "He's a lefty. He has suffered enough already."
        },
        {
          "sender": "sent",
          "text": "Guys, OP asked a question so that he could learn. Answer him and then move one. Don't down vote him for asking a question that can save lives."
        },
        {
          "sender": "received",
          "text": "Here are the four golden rules of gun safety. Anyone and everyone who owns a gun or handles a gun should know these by heart. 1. Treat every firearm as if it's loaded. 2. Never point a firearm at a..."
        }
      ]
    },
    {
      "id": "9ea5jy",
      "subreddit": "guns",
      "title": "Moving day but my guns don’t wanna come out of the closet",
      "messages": [
        {
          "sender": "sent",
          "text": "So how many of them are airsoft? Cause I see a select fire Glock, and that isn't legal to be owned unless you have a class 3 dealer license, and if you do, then this is really improper storage. The..."
        },
        {
          "sender": "received",
          "text": "I dont see any full auto AKs unless I am missing something. And the glock does not appear to have an auto sear on the back, just the selector. Which could be a modified glock slide so you can have ..."
        },
        {
          "sender": "sent",
          "text": "Well it was moving day and I had already moved the safe, and I keep the toy guns on the wall opposite the real ones, so I figured I’d get a group photo lol Real steel on the floor, and most of the ..."
        },
        {
          "sender": "received",
          "text": "The ak on the top shelf. Look at the detents. On a semi only all, there's no middle detent. I suppose it could be, but it seems unlikely to be the exact same design and stripe and placement."
        },
        {
          "sender": "sent",
          "text": "I thought no glock airsoft guns were ever allowed in the US. Glock refused to give license for name use"
        },
        {
          "sender": "received",
          "text": "Aaaahhhhhh, that's reasonable. Pretty dope collection just in the real steel. I love the Jericho, even if it is a Magnum Research copy of the CZ."
        },
        {
          "sender": "sent",
          "text": "Well, kinda. But that doesn't stop the Japanese models from making it in or other companys just ripping off the pattern."
        },
        {
          "sender": "received",
          "text": "There is no third pin though, just the safety detents"
        },
        {
          "sender": "sent",
          "text": "That is true. But if you buy it from the right people in Japan or China they take precautions to avoid customs"
        },
        {
          "sender": "received",
          "text": "Cause it's airsoft. Either way, I've never seen an AK receiver with the detents, but no sear."
        },
        {
          "sender": "sent",
          "text": "Being a cowboy bebop fan I had to get an original 1989 kbi imported one Also yeah the Airsoft guns do make it seem like I have an amazing gun collection. But I mostly just get Airsoft versions of g..."
        },
        {
          "sender": "received",
          "text": "Nice. I'd love to see pictures of that beauty. Jericho's aren't super common to see."
        },
        {
          "sender": "sent",
          "text": "I have seen quite a few. A lot of people get them etched in to make it look more legit. I have seen a lot of people do it for the cryllic auto/semi or for chinese characters on type 56. But still n..."
        },
        {
          "sender": "received",
          "text": "here’s some shitty ones"
        }
      ]
    },
    {
      "id": "9eoddf",
      "subreddit": "guns",
      "title": "Curious on the value of this FN-49. Any assistance appreciated.",
      "messages": [
        {
          "sender": "sent",
          "text": "This is a doozy. Collectibility (and therefore price) of FN49s is down to originality, and addition of a BAR magwell and Venezuelan contract muzzle brake and new replacement stock (which was common..."
        },
        {
          "sender": "received",
          "text": "Hmm, now that you've confirmed my worser fear that it's a Franken-rifle, I must agree. I do want the rifle, however. Or more clearly, I want the rifle for the \"old lady\" as she absolutely loves sho..."
        },
        {
          "sender": "sent",
          "text": "The Venezuelan 7mm is the sweetest-shooting battle rifle you'll ever find. My only FN49 at the moment was an unfired like-new Venezuelan contract. They are worth every penny You could also look at ..."
        },
        {
          "sender": "received",
          "text": "I don't have any appeal for the Garand purely because they don't perform as well as I'd like and they're not accurate enough for my taste (I could blame some of this on the specific ammo they must ..."
        },
        {
          "sender": "sent",
          "text": "Fair enough. I like my Garands just for shooting steel gongs at distance rather than trying to shoot the x ring out of a bullseye target. 3+ MOA is more than acceptable for my purposes"
        },
        {
          "sender": "received",
          "text": "I'd buy it purely for the \"Ping\""
        },
        {
          "sender": "sent",
          "text": "The ping is downright delightful"
        },
        {
          "sender": "received",
          "text": "Ok, so actually went and visitted the guy and so I've got more disturbing new. It's not actually an Egyptian contract as my friends told me, but a true Venezuelan, but rechambered for 8mm and then ..."
        },
        {
          "sender": "sent",
          "text": "Lord Jesus. Again, it's a cool project I guess. But with this new info I wouldn't bother making any offer on it"
        },
        {
          "sender": "received",
          "text": "Same. And guy wouldn't budge off of $1000 for it. I told him I'd do $350 at best and he went on a tirade about how he did so much work getting that magwell right and that it being mag-fed should in..."
        },
        {
          "sender": "sent",
          "text": "That's the Ikea effect in action if I've ever seen it!"
        },
        {
          "sender": "received",
          "text": "Good lord that's approaching my bubba'd FN level territory"
        },
        {
          "sender": "sent",
          "text": "thats fucking gold"
        }
      ]
    },
    {
      "id": "9er6zi",
      "subreddit": "guns",
      "title": "My 1911s, they're multiplying like rabbits! 4 years ago I had none.",
      "messages": [
        {
          "sender": "sent",
          "text": "Nice collection. I have to ask as I've seen many people with numerous 1911s. Why multiples? I know there's different barrel lengths and chambering but, why? I have a 1911 and I love it, but I have ..."
        },
        {
          "sender": "received",
          "text": "&gt; Nice collection. &gt; Why multiples?"
        },
        {
          "sender": "sent",
          "text": "Lol. Yeah I guess I kinda did answer my own question a little bit. I guess I'm more interested in why people have a collection of multiples of the same gun. I have different hobby collections so I ..."
        },
        {
          "sender": "received",
          "text": "Its the same reason anyone collects things. None of mine are identical, they're all a bit different even if it's the same design and caliber. I'm also a believer in redundancy. If a gun breaks, I'l..."
        },
        {
          "sender": "sent",
          "text": "I get you. That makes sense. I never really thought of the redundancy angle, but that's a great point. I too live in CA and feel your frustration on those ridiculous arbitrary gun laws. Thanks for ..."
        },
        {
          "sender": "received",
          "text": "I have a kimber master carry ultra but I have this springfield range officer with a full rail chambered in a 9mm stuck in my head. It calls to me but the Wilson combat edc x9 is like the holy grail..."
        },
        {
          "sender": "sent",
          "text": "I would sell any 3 or 4 of my current 9mm collection to get the Wilson EDC X9 but it's a no-go in CA."
        },
        {
          "sender": "received",
          "text": "I understand US wars 1911 collections. I dont understand 7 new ones though"
        },
        {
          "sender": "sent",
          "text": "Because of the capacity?"
        },
        {
          "sender": "received",
          "text": "Mostly due to the CA roster law. The capacity issue could be worked around with modified to 10 round mags before they entered the state."
        },
        {
          "sender": "sent",
          "text": "What's the roster law?"
        },
        {
          "sender": "received",
          "text": "I have a canned message for whenever this is brought up. CA has a \"roster of approved handguns\" that has a lot of ridiculous restrictions that has effectively banned more and more guns every year, ..."
        },
        {
          "sender": "sent",
          "text": "Damn dude"
        }
      ]
    },
    {
      "id": "9ergsp",
      "subreddit": "guns",
      "title": "GF left me for someone else, so I went Labor Day shopping and now I shower with a new beauty.",
      "messages": [
        {
          "sender": "sent",
          "text": "Hope you use protection 😉"
        },
        {
          "sender": "received",
          "text": "Let’s just say CLP as a lubricant doesn’t burn quite as bad as you’d think 🌚"
        },
        {
          "sender": "sent",
          "text": "Okay what the fuck"
        },
        {
          "sender": "received",
          "text": "Don't question someone's kinks"
        },
        {
          "sender": "sent",
          "text": "Haha my humor is sick, I know."
        },
        {
          "sender": "received",
          "text": "We ammosexuals have to stick together!"
        },
        {
          "sender": "sent",
          "text": "Let’s talk rustproofing. These Colecos Aeros will rust up on you like that!"
        },
        {
          "sender": "received",
          "text": "until said persons dick develops an unknown form of cancer"
        },
        {
          "sender": "sent",
          "text": "Well if you fit in that, then either you're using too many steroids, or you're sick with something serious and need to consult a doctor. ;)"
        },
        {
          "sender": "received",
          "text": "yolo"
        },
        {
          "sender": "sent",
          "text": "Stick to Federal Premium and avoid steel cased TULA."
        },
        {
          "sender": "received",
          "text": "Dont kink shame"
        }
      ]
    },
    {
      "id": "9ez65a",
      "subreddit": "guns",
      "title": "My Customized Kimber Eclipse .45 1911",
      "messages": [
        {
          "sender": "sent",
          "text": "Does .45 typically have enough gas to run a comp? I have considered something similar but the common response was that there isn't enough gas and that any benefit comes from having a weight at the ..."
        },
        {
          "sender": "received",
          "text": "If you’re serious about using a comp you tune the load for it. For factory ammo you’d have to find what works. Best results come from integrated or threaded comps."
        },
        {
          "sender": "sent",
          "text": "I shoot 9mm major (124 grain at 1380 FPS) with AA7 (9.8 grains of it) to run the comp with enough gas to make a big difference. Even trying to do the same in 45 is going to have sub-par results unl..."
        },
        {
          "sender": "received",
          "text": "That's not what he's asking. He's asking if there is enough gas left over when the bullet leaves the barrel to power the comp in a way that reduces recoil in a meaningful way, the answer in this ca..."
        },
        {
          "sender": "sent",
          "text": "Does it still jam?"
        },
        {
          "sender": "received",
          "text": "Unless its a lightweight titanium piece, which would make it much more $$$."
        },
        {
          "sender": "sent",
          "text": "Well, I have the same comp on my Colt. I'm not sure how much gas it really redirects, but it helps keep the barrel down a bit. I'm thinking it has more to do with the extra weight of the comp than ..."
        },
        {
          "sender": "received",
          "text": "Of course it does, it's a 1911."
        },
        {
          "sender": "sent",
          "text": "Not always. The comp adds weight. Tilting barrel designs mean the weight is at a point where that weight is being lifted the most it possibly can."
        },
        {
          "sender": "received",
          "text": "Yeah. The issue seems to be that hitting the power factor floor while also having enough gas to run the comp is what matters."
        },
        {
          "sender": "sent",
          "text": "Kimber at that...."
        },
        {
          "sender": "received",
          "text": "Yeah I was going to comment that too haha"
        },
        {
          "sender": "sent",
          "text": "What if you put a bushing comp on a 4\" barrel 1911?"
        }
      ]
    },
    {
      "id": "9f09vw",
      "subreddit": "guns",
      "title": "2011 80% build",
      "messages": [
        {
          "sender": "sent",
          "text": "I’m considering building a 80% 2011 to use in competitions. It seems like a fun project, and I’d get a nice new competition gun at the end of it. Has anyone here done a 2011 build? Do you save a lo..."
        },
        {
          "sender": "received",
          "text": "You’re banned from the match if you bring a .357 SIG 2011."
        },
        {
          "sender": "sent",
          "text": "Pfff, just cause you didn’t think of such a sexy combination of gun and caliber?"
        },
        {
          "sender": "received",
          "text": "Bro you can admit being Limited-curious, and wanting to play with gaping magwells, real mag capacity, and equipment anarchy. Just admit it, and you can use my Edge for a match. It’s okay to be like..."
        },
        {
          "sender": "sent",
          "text": "I see that well and all I wanna do is put a mag in it, but then I remember that it’s chambered is 40 and I go soft. Why haven’t you sold your edge since you bought your atlas?"
        },
        {
          "sender": "received",
          "text": "Don’t knock until you try it. Just remember .40 is less gay than CrossFit and carry optics, both of which you like. Because I need a backup gun. I ain’t got time for spare parts."
        },
        {
          "sender": "sent",
          "text": "How hard would it be to convert an edge to 357sig? It would just be a barrel change, a new mainspring, and the mags would interchange right?"
        },
        {
          "sender": "received",
          "text": "Just a new barrel."
        },
        {
          "sender": "sent",
          "text": "You should sell me that edge of yours at some point when you buy another atlas"
        },
        {
          "sender": "received",
          "text": "Only if you shoot it in the one true caliber, .40 S&amp;W."
        },
        {
          "sender": "sent",
          "text": "Negative, it’s gonna immediately converted to 357 sig"
        },
        {
          "sender": "received",
          "text": "You’re so gay"
        },
        {
          "sender": "sent",
          "text": "You’ll cave when your atlas isn’t so new and you want another one"
        }
      ]
    },
    {
      "id": "9f2kao",
      "subreddit": "guns",
      "title": "Anyone getting a CMP 1911?",
      "messages": [
        {
          "sender": "sent",
          "text": "Who is getting a 1911 from CMP? Post some pictures when it shows up. I've already got one. Tough to upgrade from here."
        },
        {
          "sender": "received",
          "text": "$850 for a gun that's been used and abused and is likely 30 years old or more? History isn't worth that much to me."
        },
        {
          "sender": "sent",
          "text": "Let us know if you ever find a better price."
        },
        {
          "sender": "received",
          "text": "For what it is, you can't find cheaper usually. But to 99.99% of people, it being used ww2 doesn't make it twice as valuable to them. They are cool history pieces, but I think the market is even mu..."
        },
        {
          "sender": "sent",
          "text": "Then you aren't familiar with the 1911 market. People constantly pay more than this for WW2 1911s. And btw, the CMP isn't selling to 99.99% of people. They're selling to collectors. Everyone else b..."
        },
        {
          "sender": "received",
          "text": "I am familiar, I'm just saying I personally don't think the prestige warrants the increased price. You can get a battle used ww2 gun for under $300"
        },
        {
          "sender": "sent",
          "text": "It's true, lots of nostalgia drives the 1911 market (as it does for the M1), but it's still a great shooter even with poor accuracy. The grip, the heft, the balance, the stahpin powa. Can't get tha..."
        },
        {
          "sender": "received",
          "text": "\\&gt;History isn't worth that much to me. If you just want a shootable 1911 these are ridiculously overpriced. Hence my qualifier. M1's are different since they are much harder to come by a compara..."
        },
        {
          "sender": "sent",
          "text": "Eh, they get to make their money AND undercut the market heavily selling at this price, and that's fine by me. Unwilling to pay =/= overpriced"
        },
        {
          "sender": "received",
          "text": "Actually anyone can buy from CMP lmfao. It's super easy and takes no more than 15 minutes of effort."
        },
        {
          "sender": "sent",
          "text": "Which ww2 guns are under $300 right now besides extremely rough mismatched mosins?"
        },
        {
          "sender": "received",
          "text": "Some people think that's too much for some reason. I am not one of them. That's besides the point however, the CMP does not price these guns for the joe schmoe, but for collectors. That's why, as a..."
        },
        {
          "sender": "sent",
          "text": "gewehrs often, TT33, nagant revolvers, Mausers, Arisaka, Carcano sometimes. Rough unmatched mosins? You can easily get a matching mosin for about $300 still, rough unmatched go for under $250 local..."
        }
      ]
    },
    {
      "id": "9f4h84",
      "subreddit": "guns",
      "title": "Official Politics Thread 12 September 2018",
      "messages": [
        {
          "sender": "sent",
          "text": "Fire away!"
        },
        {
          "sender": "received",
          "text": "California Sacramento judge strikes down 95-year-old California ban on handgun advertising signs As detalied in this article, the (Obama appointed) district court judge ruled that (PDF) California'..."
        },
        {
          "sender": "sent",
          "text": "Good news out of the People's Republic.... am I in a coma?"
        },
        {
          "sender": "received",
          "text": "Most of the gibbering nonsense coming out of California court cases comes from the 9th circuit making rulings en banc overturning otherwise good lower court rulings. The 9th has also generally been..."
        },
        {
          "sender": "sent",
          "text": "&gt; The Supreme Court has reiterated that the Government cannot justify content-burdens on speech based on the \"fear that people would make bad decisions if given truthful information.\" Holy shit ..."
        },
        {
          "sender": "received",
          "text": "I mean, it’s just about advertising, but I guess a win is a win?"
        },
        {
          "sender": "sent",
          "text": "&gt;\"California may not accomplish its goals by violating the First Amendment\" Oh snap! We need more of this."
        },
        {
          "sender": "received",
          "text": "Nickels and dimes still make a dollar."
        },
        {
          "sender": "sent",
          "text": "To add to that, also in California. SB1100 is pending signature from Jerry Brown. restricts manufacture and purchase of firearms by adults under the age of 21. AB2103 is also pending signature. Def..."
        },
        {
          "sender": "received",
          "text": "Is this the real life? Is this just fantasy?"
        },
        {
          "sender": "sent",
          "text": "About damn time!"
        },
        {
          "sender": "received",
          "text": "It's meme material."
        },
        {
          "sender": "sent",
          "text": "They do have landslides in CA."
        },
        {
          "sender": "received",
          "text": "With an appended \"or Second Amendment\""
        },
        {
          "sender": "sent",
          "text": "&gt;Thus, the Government's theory is essentially that an impulsive person will see a handgun car sign outside a store, will impulsively buy the gun car (although the Government does not identify a ..."
        }
      ]
    },
    {
      "id": "9f57sb",
      "subreddit": "guns",
      "title": "Just a reminder to always practice safe gun handling",
      "messages": [
        {
          "sender": "sent",
          "text": "So a story for you guys My buddy just bought a Rock Island 1911. He didn't know how to clean it and asked me to show him how. So i stripped it down showed him the places to oil, grease, and clean, ..."
        },
        {
          "sender": "received",
          "text": "So you managed to fully disassemble it, reassemble it, and a round remained in the chamber?"
        },
        {
          "sender": "sent",
          "text": "Just a field strip, and on a 1911, when you release the slide it chambers a round."
        },
        {
          "sender": "received",
          "text": "Yeah, out of the loaded mag you must have inserted into it immediately prior."
        },
        {
          "sender": "sent",
          "text": "&gt;put a loaded mag into a gun &gt;drops slide, chambering a round &gt;surprised when gun goes off after pulling the trigger"
        },
        {
          "sender": "received",
          "text": "He brought it to me loaded"
        },
        {
          "sender": "sent",
          "text": "So you unloaded it as part of the disassembly process... THEN RELOADED THE FIREARM?! And you where somehow surprised it went off when you chambered a round and pulled the trigger?"
        },
        {
          "sender": "received",
          "text": "I didn't unload to disassemble and that was my mistake"
        },
        {
          "sender": "sent",
          "text": "It isn't possible to field-strip a 1911 with the magazine inserted. You inserted a loaded magazine, chambered it, and fired it."
        },
        {
          "sender": "received",
          "text": "That is literally not possible. EDIT TO ADD: Since you may need visual aids:"
        },
        {
          "sender": "sent",
          "text": "Unlike every other semi-auto in the known universe? The problem with these \"stay safe out there folks!\" posts is that you are only talking to other dipshits out there. It's a fucking GUN! CARE MORE..."
        },
        {
          "sender": "received",
          "text": "Wrong answer, McFly!"
        },
        {
          "sender": "sent",
          "text": "Your story is literally impossible, you cannot remove the slide and barrel from 1911 with a loaded magazine inserted. And dropping the slide on a loaded magazine always chambers a round."
        },
        {
          "sender": "received",
          "text": "BINGO."
        },
        {
          "sender": "sent",
          "text": "Well that’s bullshit"
        }
      ]
    },
    {
      "id": "9f7on5",
      "subreddit": "guns",
      "title": "Got a Cheap Old Shotgun for Free",
      "messages": [
        {
          "sender": "sent",
          "text": "I wanna do something to it. It's a Winchester 1200 I think. Right now it has a 20 or so inch barrel with a rib. What should I do to it? Part of me thinks SBS but the other part doesnt want to spend..."
        },
        {
          "sender": "received",
          "text": "Take it to Vietnam?"
        },
        {
          "sender": "sent",
          "text": "I do like a good heat shield."
        },
        {
          "sender": "received",
          "text": "Trench guns keep the Germans away."
        },
        {
          "sender": "sent",
          "text": "I'll be shooting potato mashers back into their trenches in no time."
        },
        {
          "sender": "received",
          "text": "Keep the Russians out and the Germans down!"
        },
        {
          "sender": "sent",
          "text": "Relevant video on shotguns."
        },
        {
          "sender": "received",
          "text": "Man, the US used a ridiculous variety of shotguns during vietnam. I find it Ironic they used the Stevens 67/77 the most though. That shotgun is a bad candidate for a combat (or any role) shotgun imo."
        },
        {
          "sender": "sent",
          "text": "All they had to do was take out a dam and flood Hanoi. Vietnam was bad decisions incarnate."
        },
        {
          "sender": "received",
          "text": "Awesome lol"
        },
        {
          "sender": "sent",
          "text": "The US could have easily won Vietnam militarily in a matter of weeks if they were willing to escalate the war effort. The problem was risking escalation in turn by China which is biting off more th..."
        },
        {
          "sender": "received",
          "text": "Yup, Vietnam was a multi decade political failure. 4 straight administrations backed the wrong leaders and were unable to really solve the real problem which was that South Vietnamese leadership wa..."
        }
      ]
    },
    {
      "id": "9fcqfa",
      "subreddit": "guns",
      "title": "Is it \"ok\" to use a .410 that is 1.5mm off face?",
      "messages": [
        {
          "sender": "sent",
          "text": "As in the barrel and receiver are not connected at all? In that case, not safe. Pictures would help describe what you are asking."
        },
        {
          "sender": "received",
          "text": "It's not really this rusty just the flash"
        },
        {
          "sender": "sent",
          "text": "Is that a single shot break action?"
        },
        {
          "sender": "received",
          "text": "That is a much larger gap than I have ever seen on any other break action shotgun. Does the barrel lock up tight to the receiver when it is closed? It may be ok, it may not be. I personally wouldn'..."
        },
        {
          "sender": "sent",
          "text": "Yes"
        },
        {
          "sender": "received",
          "text": "No, it is not safe"
        },
        {
          "sender": "sent",
          "text": "Fuck no the lockup should be tight."
        },
        {
          "sender": "received",
          "text": "So what can i Use some shim to tighten it up?"
        },
        {
          "sender": "sent",
          "text": "Are you seriously suggesting using shims on a firearm to fix the fit between receiver and barrel? No."
        },
        {
          "sender": "received",
          "text": "On the hinge with a peice of stamped steel"
        },
        {
          "sender": "sent",
          "text": "I already gave you an answer it’s a bad idea. Look if this was some end of the world situation and it’s the only gun you had then yeah go nuts but do you really want to risk your eyeballs and fingers?"
        },
        {
          "sender": "received",
          "text": "Then how should it be fixed?"
        },
        {
          "sender": "sent",
          "text": "I don’t know that it can be, I’m guessing it’s a cheap break action and that it’s worn out."
        }
      ]
    },
    {
      "id": "9fh8tu",
      "subreddit": "guns",
      "title": "A short story about how a small independantly owned gun shop got me out of a pinch:",
      "messages": [
        {
          "sender": "sent",
          "text": "So I ordered a $220 Storm Lake threaded barrel from midway, in anticipation that I will eventually receive the silencer that I purchased back in March. It was supposed to be for my full size M&amp;..."
        },
        {
          "sender": "received",
          "text": "There is a good reason many places wont do that with gun parts, it's because 98% of people will dick with/damage the product and swear they didn't which may cause safety issues for the next owner. ..."
        },
        {
          "sender": "sent",
          "text": "This is why I refuse to ever sell a gun, you only get dicked on prices. I only buy new ones!"
        },
        {
          "sender": "received",
          "text": "The way I see it, my kids will appreciate this gun I was going to sell more than I'll appreciate the few hundred I'll get by selling it."
        },
        {
          "sender": "sent",
          "text": "This is a good philosophy to have. I pretty much follow it with one exception. Collectables."
        },
        {
          "sender": "received",
          "text": "Or sell them privately and not lose your ass."
        },
        {
          "sender": "sent",
          "text": "In my local gun selling community, people want NIB price + $100 for their used guns. It's crazy."
        },
        {
          "sender": "received",
          "text": "Yup. My first gun was bought from a guy who had been using it since the early 2000s. I hope to give it to my kids one day."
        },
        {
          "sender": "sent",
          "text": "Welcome to armslist, where prices are made up and most \"buyers\" are scammers!"
        },
        {
          "sender": "received",
          "text": "Two things in life you never, ever sell... 1. Guns 2. College textbooks."
        },
        {
          "sender": "sent",
          "text": "Why in earth would you not sell your textbooks?"
        },
        {
          "sender": "received",
          "text": "Guitars! Oh how I wish I had kept my 1965 Jag, 1967 Coronado 12, 1968 Mustang, 1973, 1979 and 1980 Strats, 4003 Rick, Rick 12.... a few others lost in time. sigh."
        },
        {
          "sender": "sent",
          "text": "Agreed... they are worthless after you're done with them. Usually renting is better but if you bought one you might as well get something out of it."
        },
        {
          "sender": "received",
          "text": "Buy new textbook for $150 (class requires new edition, because of course it does). Bookstore offers you $30 for it after the semester. Fuck that noise, I'll just keep it. TL;DR Spite."
        },
        {
          "sender": "sent",
          "text": "&gt; There is a good reason many places wont do that with gun parts, it's because 98% of people will dick with/damage the product and swear they didn't which may cause safety issues for the next ow..."
        }
      ]
    },
    {
      "id": "9flbde",
      "subreddit": "guns",
      "title": "You may not like it, but this is what peak CCW performance looks like.",
      "messages": [
        {
          "sender": "sent",
          "text": "That's actually kind of a genius way to prevent printing, I'm gonna get a flesh-colored holster and grip so I can CC naked."
        },
        {
          "sender": "received",
          "text": "Um...b-belt?"
        },
        {
          "sender": "sent",
          "text": "Zap carry is best nude carry"
        },
        {
          "sender": "received",
          "text": "Just hook side velcro on the holster."
        },
        {
          "sender": "sent",
          "text": "Got to have a strong bush with good roots."
        },
        {
          "sender": "received",
          "text": "That's what your prison wallet is for"
        },
        {
          "sender": "sent",
          "text": "There's still a place to hide things when you're naked.."
        },
        {
          "sender": "received",
          "text": "I’ll buy a flesh-colored holster so I can conceal carry while open-carrying."
        },
        {
          "sender": "sent",
          "text": "Put it in the ol' prison pocket"
        },
        {
          "sender": "received",
          "text": "Then you can just braid a holster"
        }
      ]
    },
    {
      "id": "9flx4z",
      "subreddit": "guns",
      "title": "Overall best pistol round?",
      "messages": [
        {
          "sender": "sent",
          "text": ".45 ACP for suppressor use 9mm for all other use .40 S&amp;W for communist 10 round mag states .45 Long Colt for 6 bullets, more than enough to kill anything that moves"
        },
        {
          "sender": "received",
          "text": "I strongly disagree on 45 being better than 9 for subsonic suppressor use. 9mm is significantly more quiet."
        },
        {
          "sender": "sent",
          "text": "Indeed"
        },
        {
          "sender": "received",
          "text": "It can be, but ammo selection is better with .45ACP as most loadings for it are inherently subsonic."
        },
        {
          "sender": "sent",
          "text": "It is? I have 20+ different kinds of 147gr 9mm on hand right now and it was all far cheaper than any 230gr .45 (fmj to fmj and hp to hp). The loudest of it is also much more quiet than the most qui..."
        },
        {
          "sender": "received",
          "text": "Never said .45 was cheaper than 9mm. Never said 147 9mm was hard to find. All I said was that most .45 acp loadings were inherently subsonic, which opens up almost any loading found anywhere. For e..."
        },
        {
          "sender": "sent",
          "text": "I just don't know anyone who has suppressors who buys a few boxes at a time at retail stores. You can easily buy subsonic 9 by the pallet online from a multitude of vendors. The difference in SPL b..."
        },
        {
          "sender": "received",
          "text": "HAHAHAHAHAHAHA. &gt;.40 S&amp;W for communist 10 round mag states &lt;--- Owns a VP40. &lt;--- Lives in Marylandistan. Fair enough. You got me. ;)"
        },
        {
          "sender": "sent",
          "text": "That's just an example... which doesn't negate the fact that you have to seek out subsonic 9mm for suppressed use while almost any .45ACP will work. Not saying 9mm isnt better for sound level, not ..."
        },
        {
          "sender": "received",
          "text": "I used to be that guy buying a couple boxes locally. Then discovered sgammo..."
        },
        {
          "sender": "sent",
          "text": "Tbh, they make some really ballsy 165 grain loads. The problem with .40 is they kept trying to use 180 grain bitch boi FBI load copies instead of going lighter and packing more powder in that case."
        },
        {
          "sender": "received",
          "text": ".40 S&amp;W for communist 10 round mag states the trash can We still have a little bit of dignity in shitholes like New Jersey, thank you very much"
        },
        {
          "sender": "sent",
          "text": "Hater. .40 is fun."
        },
        {
          "sender": "received",
          "text": "No. .45 has uses outside of suppression. It has \"because it works\" use."
        }
      ]
    },
    {
      "id": "9fni8w",
      "subreddit": "guns",
      "title": "Taking my cousin to the range for the first time. Tomorrow's going to be fun.",
      "messages": [
        {
          "sender": "sent",
          "text": "Case top left: 16\" upper from ds arms with a Vortex spitfire red dot. Lower- sharps \"hellbreaker\" with a geissele 2 stage trigger. DDM4V11 pro upper with a Vortex 1-6 strike eagle. Marlin GBL 45.-7..."
        },
        {
          "sender": "received",
          "text": "Very nice. Happen to have a 10-22 or something? If its a first timer starting out on a 22 helps a ton."
        },
        {
          "sender": "sent",
          "text": "Unfortunately not. I know that's the best training gun and I should get one though. I have 22 caliber though. Close enough?"
        },
        {
          "sender": "received",
          "text": "Ya any 22 is a good choice."
        },
        {
          "sender": "sent",
          "text": "Is that Yugo an M59/66a1? I bought one a while back from Cabela's, de-cosmo'd it but haven't shot it yet. I was wondering what it's like."
        },
        {
          "sender": "received",
          "text": "It's nice actually. I had a bit of a problem with the gas system though. The gas block was all rusted out with the corrosive ammo and didn't want to cycle properly. I bought a new one online for li..."
        },
        {
          "sender": "sent",
          "text": "Sweet, thanks for the info. I believe the two different measurements on the grenade launcher site were meant for artillery and personal. But I've wondered how accurate they really are, I think it w..."
        },
        {
          "sender": "received",
          "text": "To use the grenade sights - Unfold the ladder-sights until they are ninety degrees perpendicular to the barrel, then slide the shaft of a 22mm rifle grenade into the launcher cup, be sure it is com..."
        },
        {
          "sender": "sent",
          "text": "How'd the shoot go? She enjoy it?"
        },
        {
          "sender": "received",
          "text": "She had a blast. She was surprised by how the ar shot. She wanted to try the 45. 70.and shot it from a bench! The sks had 7 malfunctions in 15 shots so I have to work on that. And she loved shootin..."
        },
        {
          "sender": "sent",
          "text": "That's awesome! Glad y'all had fun. That's the opposite of how I turned out, god I hate shotgun for some reason and can't hit shit with it."
        }
      ]
    },
    {
      "id": "9fowei",
      "subreddit": "guns",
      "title": "Official Politics Thread 14 September 2018",
      "messages": [
        {
          "sender": "sent",
          "text": "Fire away!"
        },
        {
          "sender": "received",
          "text": "#California SB1100 is pending signature from Jerry Brown. restricts manufacture and purchase of firearms by adults under the age of 21. AB2103 is also pending signature. Defines a statewide standar..."
        },
        {
          "sender": "sent",
          "text": "&gt; restricts manufacture and purchase of firearms by adults under the age of 21. My opinion, if they pass this, adults under 21 don't get to vote either."
        },
        {
          "sender": "received",
          "text": "Why"
        },
        {
          "sender": "sent",
          "text": "They can't vote, so it doesn't matter. Go back to your hole mile high sandwhich maker."
        },
        {
          "sender": "received",
          "text": "If you're not old enough to buy a firearm and exercise your constitutional rights you sure as hell aren't old enough to vote to restrict other people's rights or drive a car that has greater likely..."
        },
        {
          "sender": "sent",
          "text": "Those other things aren’t constitutional rights though."
        },
        {
          "sender": "received",
          "text": "&gt;not a constitutional right &gt;voting pick one"
        },
        {
          "sender": "sent",
          "text": "Driving, smoking, drinking, gambling isn't. RKBA, voting, jury duty is. Military service sorta sits in a grey area. But the point remains the age for all the above needs to be normalized. 16, 18, 2..."
        },
        {
          "sender": "received",
          "text": "Where does the constitution give you the right to vote? Show me."
        },
        {
          "sender": "sent",
          "text": "Where in the constitution are you granted the right to vote?"
        },
        {
          "sender": "received",
          "text": "Consider the following: Also note that even though it might not be specifically outlined in the Constitution, the Amendments and associated rulings set a precedent for future decisions."
        },
        {
          "sender": "sent",
          "text": "Right. So the constitution doesn’t explicitly grant people the right to vote."
        }
      ]
    },
    {
      "id": "9fp7tp",
      "subreddit": "guns",
      "title": "Walther PPQ",
      "messages": [
        {
          "sender": "sent",
          "text": "Hey all! I am looking into getting my first handgun. I have done quite a bit of research, but I am really drawn to the Walther ppq q4 tac. Any opinions on it?"
        },
        {
          "sender": "received",
          "text": "I've had a Walther for some time, one of my favorite handguns. Trigger reset is insanely awesome. Really enjoyed it. I've got average hands as well, fits like a glove and the grip is textured very ..."
        },
        {
          "sender": "sent",
          "text": "I'm thinking of testing it out next week before I make the purchase. I've only ever shot a xd. This will be my first personal purchase though!"
        },
        {
          "sender": "received",
          "text": "Good on ya! Always best to shoot it first if you can. Don't be scared by the right tolerances either. Walther doesn't even recommend you take the pistol apart for the first few hundred rounds. The ..."
        },
        {
          "sender": "sent",
          "text": "Haha well I am about as rookie as it gets with guns, so I dont think I'll be dabbling with building anytime soon."
        },
        {
          "sender": "received",
          "text": "Do you have any recommendations for gun carrying bags, glasses brands or ear protection?"
        },
        {
          "sender": "sent",
          "text": "As far as ear pro goes, I'm partial to the Howard leight electronics, really low profile and they work amazing! Probably the best 40 bucks I've spent in my shooting career. You can snag em on Amazo..."
        },
        {
          "sender": "received",
          "text": "Awesome. Thanks man. I'll check all that stuff out. Appreciate the tips."
        },
        {
          "sender": "sent",
          "text": "For handguns particularly you can get any number of small range bags that have compartments for handguns and they have the added value of carrying all of your other junk at the same time."
        },
        {
          "sender": "received",
          "text": "Pelicon cases for handguns too?"
        },
        {
          "sender": "sent",
          "text": "If it's handguns strictly I'd just opt for a range bag you can put it in. The Walther specifically already comes with a rather nice hard case you get included with the firearm."
        },
        {
          "sender": "received",
          "text": "Much appreciated, brother."
        }
      ]
    },
    {
      "id": "9fraa0",
      "subreddit": "guns",
      "title": "Sometimes the Air Force lets you have a little fun.",
      "messages": [
        {
          "sender": "sent",
          "text": "Why is there a rear sight under the scope? What happened to the front sight? Are you sure?"
        },
        {
          "sender": "received",
          "text": "Front sight is folded."
        },
        {
          "sender": "sent",
          "text": "You always have backup sights cuz glass breaky"
        },
        {
          "sender": "received",
          "text": "Specifically, the front sight is built into the URX2 rail on the M110."
        },
        {
          "sender": "sent",
          "text": "Wish I can hide like that. Doesn't even look like theres one folded. I don't see any cuts in the rail or anything representing a front post... where's the hinge?"
        },
        {
          "sender": "received",
          "text": "That's so cool!"
        },
        {
          "sender": "sent",
          "text": "If it was a sniper, I would be dead! Thanks for the education."
        },
        {
          "sender": "received",
          "text": "Fuck me, that’s cool. I wonder if anyone besides KAC makes a rail like that."
        },
        {
          "sender": "sent",
          "text": "At least there is something that can help justify the price for one of those rails."
        }
      ]
    },
    {
      "id": "9ftihn",
      "subreddit": "guns",
      "title": "Ready for open division",
      "messages": [
        {
          "sender": "sent",
          "text": "one of these days....I'll have one too. at least it's a bit cheaper than a 2011 decked out like that, right?"
        },
        {
          "sender": "received",
          "text": "Magazine cost alone will save you a fortune."
        },
        {
          "sender": "sent",
          "text": "aren't CZ mags made by Mec-Gar? I've got those with my Canik TP9."
        },
        {
          "sender": "received",
          "text": "It should be way cheaper. STI mags are like $125 a pop, and you'll need at least 6."
        },
        {
          "sender": "sent",
          "text": "+add like $40 per to tune the mags to the gun"
        },
        {
          "sender": "received",
          "text": "4 pack of tuned mags is $500, so $125 a mag."
        },
        {
          "sender": "sent",
          "text": "ah, i had the wrong idea"
        },
        {
          "sender": "received",
          "text": "Np my man, I think you're right as well because I see some going for like $160. Anyways, insane that you have to spend $1000+ on mags for a $3500+ gun."
        },
        {
          "sender": "sent",
          "text": "I was under the impression that you have to get the mags tuned to your individual gun, you can't just buy them pre-tuned doesn't matter to me seeing as I would never ever make that purchase haha, a..."
        },
        {
          "sender": "received",
          "text": "You're right. The 4 pack for $500 is from DVC. It looks like depending on who you buy the 2011 from, the mags have to be tuned to that gun."
        },
        {
          "sender": "sent",
          "text": "Yea it's one of the cheaper ways to get into open. And to be honest everyone seems to have a 2011 I just wanted to be a bit different."
        },
        {
          "sender": "received",
          "text": "Regular CZ 75 mags are mec gar but I'm not sure about the Tactical sport mags."
        },
        {
          "sender": "sent",
          "text": "Yea all 4 of the mags have worked out of the box. To me if I'm spending 3k+ on a gun the mags should work."
        },
        {
          "sender": "received",
          "text": "I think all CZ mags are Mec-Gar, most companies just don't like to advertise it. If it says made in italy that's your big giveaway, but if all the normal mags are made in italy I'd bet the sport ma..."
        }
      ]
    },
    {
      "id": "9fvgr3",
      "subreddit": "guns",
      "title": "How many rounds of ammo do you have when you consider yourself out of ammo? Is it different between calibers?",
      "messages": [
        {
          "sender": "sent",
          "text": "The longer I’ve been heavily into guns the numbers seems to go up for what I consider critically low. 9MM: Less than 1k rounds and I’m shopping. Less than 500 rounds and I won’t even go to the rang..."
        },
        {
          "sender": "received",
          "text": "Why keep M855 for serious use? M193 is much more ballistically effective."
        },
        {
          "sender": "sent",
          "text": "Barrier penetration is better. I also have body armor and so I assume others may as well, especially if they’re willingly walking into a gun fight. In fact, in a bug-out scenario I am gonna assume ..."
        },
        {
          "sender": "received",
          "text": "Hahhahahahaha"
        },
        {
          "sender": "sent",
          "text": "You do you, I’ll do me. I don’t know why you care so much. The gun community is full of people that have different opinions and your thoughts on my choices of what to stockpile matter to me about a..."
        },
        {
          "sender": "received",
          "text": "You seem very “prepared.”"
        },
        {
          "sender": "sent",
          "text": "Why don’t you please educate the masses then El Supremo? Clearly you have a lot to add."
        },
        {
          "sender": "received",
          "text": "If your hobby is to imagine a world gone awry and then nurture dark fantasies of staving off starvation, illness and death by piling up bodies at the end of your driveway, go for it. Just don’t pre..."
        },
        {
          "sender": "sent",
          "text": "Not a hobby, just some prudent planning. If shits that crazy I’m not staying at home. I don’t even necessarily expect to survive - but I’m not going to try and hedge my bets some and at least try. ..."
        },
        {
          "sender": "received",
          "text": "And any philosophy of use stuff I posted was to try and explain why I think your philosophy of use behind M193 wasn’t super relevant. You seem to be the timmie in this conversation, not me."
        },
        {
          "sender": "sent",
          "text": "I didn’t mention M193"
        },
        {
          "sender": "received",
          "text": "My bad, you’re right. That was another poster in this thread."
        },
        {
          "sender": "sent",
          "text": "IMO, if you're going to assume that you're going to have access to multiple guns, it would make sense to optimize them for separate purposes. \\&gt; but IIIA armor If you're facing someone with body..."
        }
      ]
    },
    {
      "id": "9fx57e",
      "subreddit": "guns",
      "title": "FDE Friday: Piston Edition",
      "messages": [
        {
          "sender": "sent",
          "text": "Rifle is Fine"
        },
        {
          "sender": "received",
          "text": "WHY YOU WANT RAIL FOR KALASHNIKOV? IS NOT GOOD ENOUGH AS PROCURED FROM IZHEVSK MECHANICAL WORKS? YOU THINK NEEDS IMPROVEMENT? THEN MAYBE YOU FIND JOB WITH ARMY OF RUSSIA! YOU HAVE DRINKS WITH MIKHA..."
        },
        {
          "sender": "sent",
          "text": "Is of favourite copy pasta comrade, thank!"
        },
        {
          "sender": "received",
          "text": "pasta is stronk"
        },
        {
          "sender": "sent",
          "text": "That's because they're not Soviet small arms developers anymore."
        },
        {
          "sender": "received",
          "text": "I see someone's playing eft!"
        },
        {
          "sender": "sent",
          "text": "I have a hard time between this one and the FN 57 copy pasta"
        },
        {
          "sender": "received",
          "text": "When I read this, why do I default to Alison Brie's voice when she is the Russian wrestler on GLOW?"
        },
        {
          "sender": "sent",
          "text": "I haven’t seen that one yet. Can you share?"
        },
        {
          "sender": "received",
          "text": "MAIN POINT OF SELLING BELGIAN FIVE SEVEN PISTOL IS EXTREME PRICE OF WEAPON AND CARTRIDGE. BELGIAN FIVE SEVEN IS WEAPON OF MAN WHO WEARS EXPENSIVE ITALIAN FASCIST SUIT OF HAND SEWING, DRIVE HUGE EXP..."
        },
        {
          "sender": "sent",
          "text": "This is life."
        }
      ]
    },
    {
      "id": "9fxigr",
      "subreddit": "guns",
      "title": "Finally put together an AR-15",
      "messages": [
        {
          "sender": "sent",
          "text": "Hate to be rude but why the jpeg?"
        },
        {
          "sender": "received",
          "text": "Is that barrel something special? How does a non free float AR shoot sub MOA?"
        },
        {
          "sender": "sent",
          "text": "&gt; I hate AR-15s Bwhaaaaaaa"
        },
        {
          "sender": "received",
          "text": "Old meets new, I like it. I like the old A-2 stocks even if they’re plain, I mean everyone knows that weapon lethality increases with coolness. Garand thumb has ruined me haha. I am working on a fe..."
        },
        {
          "sender": "sent",
          "text": "I know it’s dangerous, my work schedule, my wallet, and my wife hate that website."
        },
        {
          "sender": "received",
          "text": "What rear sight?"
        },
        {
          "sender": "sent",
          "text": "I'm about to start buying parts and assembling my own AR soon for the exact same reason, even if I don't love it."
        }
      ]
    },
    {
      "id": "9g2g4x",
      "subreddit": "guns",
      "title": "Best caliber for a home defense AR Pistol?",
      "messages": [
        {
          "sender": "sent",
          "text": "Hey guys! Hope everyone’s having a good Saturday! I was up last night looking online at AR pistol parts cause I’ve had an itch to build one but I can’t decide on what caliber to do it in? Originall..."
        },
        {
          "sender": "received",
          "text": "5.56 and .300blk are basically the same effectiveness using supersonics, but 300 will go through more walls. Using subsonic .300 you basically have a pistol and a pistol caliber would be better. Ei..."
        },
        {
          "sender": "sent",
          "text": "You clearly have never used a 3 inch slug or buckshot. A shotgun is terrible for HD."
        },
        {
          "sender": "received",
          "text": "Don't use 3 inch shells for HD dipshit. If you can't take the recoil from buckshot you need more practice or use a 20 gauge. I'm borderline anorexic and can handle a 12 gauge just fine, it's all in..."
        },
        {
          "sender": "sent",
          "text": "That doesn't make them superior to 5.56 rifles for HD. They require more training to become proficient and stay proficient with. And it's more expensive to train with."
        },
        {
          "sender": "received",
          "text": "3 people can't handle the truth that shotguns are better in most cases for home defence. Statistically rifles and shotguns are about the same lethality with something like 90ish percent of people s..."
        },
        {
          "sender": "sent",
          "text": "&gt; it's all in the stance and how you mount the gun That's fine and dandy but in a home defense situation you're probably not gonna be focusing on your stance. &gt;Shotguns are as close to a one ..."
        },
        {
          "sender": "received",
          "text": "&gt; The difference is in hit probably and that shooting someone with a shotgun as opposed to an AR looks much better in court. Lmao what? Prove it. Also the spread of a shotgun at almost any home ..."
        },
        {
          "sender": "sent",
          "text": "9 pellets in a 5-10 inch circle has a greater chance of hitting a fight stopping area than 1-2 5.56 rounds with a 2-3 inch wound track. And as for court there isn't any hard evidence because it's h..."
        },
        {
          "sender": "received",
          "text": "Guy shoots 3 teens in self defense with an AR15 gets let off with no charges. Couple kills home invader with an AR15 like weapon in self defense, shooting appears to be justified. Man defends himse..."
        },
        {
          "sender": "sent",
          "text": "You're right about stances, some people can't practice enough to have it come naturally but personally and I think with most people it's instinctive, and if you can't handle 12 gauge step down to 2..."
        },
        {
          "sender": "received",
          "text": "Lol a cylinder bore shotgun will not spread out to 10” at any HD distances. Even with a 5” spread, it’s hardly enough to justify the increased recoil, the extreme loss in capacity, and the increase..."
        },
        {
          "sender": "sent",
          "text": "62 grain Winchester Ranger Soft Point is literally a hunting round made to kill things. The reason it fragments after going through something is because of the ridiculous speeds it's going. Here's ..."
        },
        {
          "sender": "received",
          "text": "I never said it was impossible, just that it would help not using the scary gun to kill people"
        },
        {
          "sender": "sent",
          "text": "12 gauge birdshot is 20 cents a round, do most of your training with that and swap to buck to finish up. And most people with shotguns hunt or shoot skeet, plenty of trigger time to train while hav..."
        }
      ]
    },
    {
      "id": "9g4lm6",
      "subreddit": "guns",
      "title": "I have MW2 Guns too!",
      "messages": [
        {
          "sender": "sent",
          "text": "The FAL on hardcore was amazing"
        },
        {
          "sender": "received",
          "text": "Dude I forgot that was in the game until just now. It was a hardcore fav as well."
        },
        {
          "sender": "sent",
          "text": "It was like playing Team SWAT in Halo 2."
        },
        {
          "sender": "received",
          "text": "I was more of an M16 with red dot sight guy on hardcore. That thing slayed halfway across Favela."
        },
        {
          "sender": "sent",
          "text": "On CoD4, the M16A4 with stopping power and ACOG was downright trollish on hardcore."
        },
        {
          "sender": "received",
          "text": "For sure, two tap at body mass and recoil gives you a head shot. If you get ambushed hip fire was great. Best gun for HC hands down."
        },
        {
          "sender": "sent",
          "text": "Hope they bring it back someday soon! Favorite gun in all COD games for me. Pretty sure you could slap a silencer on that thing to. Dirty gun."
        },
        {
          "sender": "received",
          "text": "M16 gives it a run"
        },
        {
          "sender": "sent",
          "text": "360 get scared and pull the trigger while running away shots kill everyone down the hallway in S&amp;D"
        },
        {
          "sender": "received",
          "text": "That's actually how I met one of our most skilled \"clanmates\" in COD4. Dude said if we let him he'd win for us, so we let him set up on a silo cover and just rek house on all the dudes coming out o..."
        },
        {
          "sender": "sent",
          "text": "I remember the first time I played hardcore I thought it was stupid as hell and too hard. Then after a while I somehow started playing hardcore exclusively. After I got used to hardcore I tried to ..."
        },
        {
          "sender": "received",
          "text": "That's how I was, I had a buddy that only played hardcore and I didn't like it at first then it was eventually all I played"
        },
        {
          "sender": "sent",
          "text": "If you put holographic and silencer on, it was a two shot any range any part of the body on standard mode. Shit was dumb op"
        },
        {
          "sender": "received",
          "text": "Fuck me....all this nostalgia hittin me like a freight train. Miss the good 'ol CoD days."
        }
      ]
    },
    {
      "id": "9g6k4u",
      "subreddit": "guns",
      "title": "Legally allowed to buy guns for about 1 year and 5 months, what I have collected so far..",
      "messages": [
        {
          "sender": "sent",
          "text": "Long time lurker, finally figured out something to post. From top to bottom: Remington 870 Express Old H&amp;R 16 Guage Single Shot Beretta A300 Sporting Smith and Wesson M&amp;P15-22 Smith and Wes..."
        },
        {
          "sender": "received",
          "text": "Nice start. Maybe throw some pistols into the mix? I'm jealous of your a300 sporting, I bought an a300 for clays about a year or two before the sporting model came out."
        },
        {
          "sender": "sent",
          "text": "Would love to do pistols man, but gotta be 21 to legally buy them :( about a year and a half and I’ll be on my way haha. The A300 Sporting is awesome! I’ve ran about 800 or so through at my local c..."
        },
        {
          "sender": "received",
          "text": "Those Henry's are so fun. Cool collection."
        },
        {
          "sender": "sent",
          "text": "Indeed they are! Appreciate it sir!"
        },
        {
          "sender": "received",
          "text": "If you don't live in a commie state you can buy them in private sales."
        },
        {
          "sender": "sent",
          "text": "Sorry to hear about the age restriction. At least you have time to shop around. I only got more into shooting in my 30s, so it wasn't an issue. Good to hear that you like the a300 sporting. I feel ..."
        },
        {
          "sender": "received",
          "text": "I’ll have to look into that, I’ve heard the only way in my state is family transfer. Edit: Long guns don’t need transfer in my state, pistols do. Family transfer would be the only way."
        },
        {
          "sender": "sent",
          "text": "Definitely not worth upgrading to over an A300, but I was looking into the A400 line, my shooting buddy actually has the A400 Black, it’s a great gun. In my personal opinion, if you can dig the blu..."
        },
        {
          "sender": "received",
          "text": "Sounds like communism."
        },
        {
          "sender": "sent",
          "text": "Indeed!"
        },
        {
          "sender": "received",
          "text": "My thinking is that I'm pretty happy with and do pretty well with the a300 as it is, so it may be a while until an upgrade if I don't do an over under. By the time I'm ready, it will be an Xcel or ..."
        },
        {
          "sender": "sent",
          "text": "Absolutely, I shoot fairly well with that gun now, no sense in trying something else and basically starting fresh. Might send the trigger out to get lightened up, the guy with the A400 Black had hi..."
        },
        {
          "sender": "received",
          "text": "I only have a 10/22 so far. Bought it my first week of being 18 via private sale. Only legal way i can buy it in Florida. Changed the law to 21 because of the parkland shooting. :("
        }
      ]
    },
    {
      "id": "9gaouk",
      "subreddit": "guns",
      "title": "I got a lamp!",
      "messages": [
        {
          "sender": "sent",
          "text": "It's a Major Award! Display that in your front window proudly for all the neighbors to see."
        },
        {
          "sender": "received",
          "text": "\"Fragile\"...must be Italian."
        },
        {
          "sender": "sent",
          "text": "Heh, clever"
        },
        {
          "sender": "received",
          "text": "“FRAH GIEEEEEEEE LEHHHHHHHH”"
        },
        {
          "sender": "sent",
          "text": "In this case, it actually is."
        },
        {
          "sender": "received",
          "text": "\"NOT A FINGER\""
        },
        {
          "sender": "sent",
          "text": "wife breaks it YOU WERE ALWAYS JEALOUS OF THAT LAMP"
        },
        {
          "sender": "received",
          "text": "\"Don't wanna waste electricity!\" all other house lights are on"
        },
        {
          "sender": "sent",
          "text": "YOU USED ALL THE REM OIL ON PURPOSE!"
        },
        {
          "sender": "received",
          "text": "Ah the soft glow of electric sex gleaming in the window"
        },
        {
          "sender": "sent",
          "text": "Oooh fuuuudge..."
        },
        {
          "sender": "received",
          "text": "You'll shoot youre eye out kid."
        }
      ]
    },
    {
      "id": "9gbn2n",
      "subreddit": "guns",
      "title": "What shotgun is this?",
      "messages": [
        {
          "sender": "sent",
          "text": "It is more than likely a rem 870 or Moss 500. Either way you can do practically the same thing to both and give them the same look."
        },
        {
          "sender": "received",
          "text": "I figured it would be one of those. Ill take a look at Moss modifications and see what parts i can find for it."
        },
        {
          "sender": "sent",
          "text": "I don’t think it’s a 500, they don’t have the ability to accept mag tube extensions. Could be a 590"
        },
        {
          "sender": "received",
          "text": "Why? None of that junk improves the functionality of your shotgun. You know what does? Spending that money on buck, slugs and range time. I shoot slugs out to 100 yards with the rib and bead on my ..."
        },
        {
          "sender": "sent",
          "text": "Or maybe I just like the way some of it looks? Not every gun needs to function for defensive capabilities. I can't stand the idea thst EVERY gun has to be super functional or it's worthless. Oh, yo..."
        },
        {
          "sender": "received",
          "text": "It's less about fashion and more about do you really want to load up a \\~$500 shotgun with an additional $500-$600 worth of furniture just for looks or a marginal at best improvement in performance?"
        },
        {
          "sender": "sent",
          "text": "It’s more so you don’t sound like you own many firearms so you’d be better off spending those $100’s on ammo and range time rather than toys. I know too many people with fancy decked out guns who n..."
        },
        {
          "sender": "received",
          "text": "You're definitely right about the prices, but I don't plan on getting everything in the picture. I also see people spending hundreds on their AR's just or cosmetic purposes, so I figured why can't ..."
        },
        {
          "sender": "sent",
          "text": "Head over to and it's a bunch of people spending way too much money to get a rifle to look as plain as possible. You do you man, it's your money. I'm guessing the shotgun is an 870, but as an owner..."
        },
        {
          "sender": "received",
          "text": "My 590 came with a tube extension so it's more than likely the 590."
        },
        {
          "sender": "sent",
          "text": "lol and they're always the first ones to tell you about your guns. I know quite a few people that shoot maybe twice a year and love to lecture me in my guns and purchases."
        },
        {
          "sender": "received",
          "text": "Bring the downvotes for telling a newbie to focus on shooting instead of buying accessories, don’t bother me."
        },
        {
          "sender": "sent",
          "text": "Exactly. I used to shoot 3x a month, now it’s more like 1-2x but owning a lot of budget friendly guns means I can afford ammo on my blue collar paycheck. Know another guy who bought his third Wilso..."
        }
      ]
    },
    {
      "id": "9ggf5o",
      "subreddit": "guns",
      "title": "51P PDW - Battle Pistol",
      "messages": [
        {
          "sender": "sent",
          "text": "Freshly acquired PTR 51P PDW, an 8\" barrel .308 pistol version of the PTR 91. I already put a Shockwave Blade on it, but it will definitely suck to shoot, so it might be time to start buying stamps."
        },
        {
          "sender": "received",
          "text": "Tax stamp and the standard black ptr stock with the recoil pad shouldn't be bad shooting."
        },
        {
          "sender": "sent",
          "text": "Hey hop"
        },
        {
          "sender": "received",
          "text": "Try a larger brace, like the Tailhook. The Blade really lives up to its name."
        },
        {
          "sender": "sent",
          "text": "I say get a wood stock"
        },
        {
          "sender": "received",
          "text": "Yes and a metal trigger housing ."
        },
        {
          "sender": "sent",
          "text": "SBA3"
        },
        {
          "sender": "received",
          "text": "Nah, get the Spuhr stock gun Jesus has on his G3"
        }
      ]
    },
    {
      "id": "9ghfdq",
      "subreddit": "guns",
      "title": "Official Politics Thread 17 September 2018",
      "messages": [
        {
          "sender": "sent",
          "text": "Fire away!"
        },
        {
          "sender": "received",
          "text": "Growing up I always thought fairy tales were rather silly. Now with Kavanaugh's nomination imminent and yet another sexual assault allegation being screamed about in the press, I just am fondly rec..."
        },
        {
          "sender": "sent",
          "text": "Fairy tales are usually based in life lessons, from what I've seen."
        },
        {
          "sender": "received",
          "text": "Precisely! Every culture has some variant of them, and the story format has a much bigger psychological impact than just straight up telling you what the lesson is supposed to be. I'd send all 100 ..."
        },
        {
          "sender": "sent",
          "text": "We're already damn near getting to that point. Seriously bad people are gonna start walking free because people are using sexual assault allegations as a political tool, and it's just discrediting ..."
        },
        {
          "sender": "received",
          "text": "We should probably wait for the dust to settle on this before we start calling the potential victim a liar. Just because the timing is inconvenient doesn't mean there isn't merit."
        },
        {
          "sender": "sent",
          "text": "The timing is oddly convenient."
        },
        {
          "sender": "received",
          "text": "\"Whosoever pulls this AR from Chuck Heston's cold dead hands shall be crowned ATF director.\""
        },
        {
          "sender": "sent",
          "text": "Does anyone else have a foreboding feeling going into this next election? I know there's a nearly unlimited amount of propaganda pointed at us for supporting the second, but I can't shake the feeli..."
        },
        {
          "sender": "received",
          "text": "Not only are Democrats riled up but Republicans haven't done shit for the gun community. A majority in Congress with a Repub prez? We should have national reciprocity and suppressors to our doors. ..."
        },
        {
          "sender": "sent",
          "text": "The timing is right on schedule. The conventional attacks of abortion, guns and racism didn't seem to work. So they turned to their nuke. The hottest of hot buttons: a rape allegation. Not just \"un..."
        },
        {
          "sender": "received",
          "text": "I think you mean nonthreatening Kentucky Long Rifle"
        },
        {
          "sender": "sent",
          "text": "That's what pisses me off the most, we've had a golden opportunity to get some meaningful legislation/protections put in place and our representatives threw it away. Now the antis are more rapid th..."
        },
        {
          "sender": "received",
          "text": "&gt; What's the next line of defense? I really don't know. I don't either. Unless the Supreme Court grows some nuts soon I think we're pretty well fucked over the next decade."
        },
        {
          "sender": "sent",
          "text": "More often than not the house and/or senate flips party in midterms so might as well plan for what's expected and do your part to fight. Regardless, it's only a matter of time which is why people s..."
        }
      ]
    },
    {
      "id": "9ghfy3",
      "subreddit": "guns",
      "title": "Moronic Monday 17 September 2018",
      "messages": [
        {
          "sender": "sent",
          "text": "I finally put tech sights on a 10/22. Reddit was right. This is awesome."
        },
        {
          "sender": "received",
          "text": "Anyone have any clue on what sort of CUP pressures (or any number) .276 pedersen runs?"
        },
        {
          "sender": "sent",
          "text": "WAIT A SEC WHAT ARE YOU DOING!?"
        },
        {
          "sender": "received",
          "text": "Am curious too..."
        },
        {
          "sender": "sent",
          "text": "Best I could find in 30 seconds."
        },
        {
          "sender": "received",
          "text": "I have you tagged as Hotchkiss, so I can only assume you're rechambering a Hotchkiss in 276 Pedersen."
        },
        {
          "sender": "sent",
          "text": "Having looked up doing a .276 Pedersen Garand before, it is way more doable on paper than it has any right to be."
        },
        {
          "sender": "received",
          "text": "That's great, thanks"
        },
        {
          "sender": "sent",
          "text": "Ha, I actually want to do something else. I would love to have another caliber barrel, but the lugs/quick change mechanism on the barrel* make that too much effort other than an 8mm rechamber. Othe..."
        },
        {
          "sender": "received",
          "text": "I've thought about it but I don't want to mess with a garand. I got higher aspirations for both of my ideas for this.."
        },
        {
          "sender": "sent",
          "text": "We were tossing around whether or not it would be feasible when those Korean garands were in the news again. Figured if they came in, a lot would be trashed except for the receiver, so what could y..."
        },
        {
          "sender": "received",
          "text": "I'm in the process of doing one in 7mm-08 right now. It's nearly identical in dimensions and performance to 276 Pedersen."
        },
        {
          "sender": "sent",
          "text": "But not nearly enough élan vital."
        },
        {
          "sender": "received",
          "text": "brb, making 276 casing drawing dies."
        },
        {
          "sender": "sent",
          "text": "Apparently converting 6.5 Mannlicher-Schönauer to .276 Pedersen is pretty straight forward."
        }
      ]
    },
    {
      "id": "9gkqk2",
      "subreddit": "guns",
      "title": "I too enjoy illumination by deflagration",
      "messages": [
        {
          "sender": "sent",
          "text": "Put on your running shoes boys! Who pays big money for Holland and Holland? Defiles it twice or more on reddit, where it's widely panned! The Bubba Man Can The Bubba Man Can Who ensures pearls are ..."
        },
        {
          "sender": "received",
          "text": "Pass me the hacksaw fam"
        },
        {
          "sender": "sent",
          "text": "Well Gunnit Rust is this weekend so..."
        },
        {
          "sender": "received",
          "text": "Just watched this over the weekend. I prefer this version."
        },
        {
          "sender": "sent",
          "text": "So... I shouldn’t short barrel stamp my Citori?"
        },
        {
          "sender": "received",
          "text": "I look forward to seeing it in Gunnit Rust."
        },
        {
          "sender": "sent",
          "text": "That would be tits, cut down to forearm and threaded for chokes."
        },
        {
          "sender": "received",
          "text": "People say ya won't."
        },
        {
          "sender": "sent",
          "text": "Need to finish my Evil Dead Savage 311 rebuild first. Having a heck of a time finding a 20 ga forend iron and the correct hammers"
        },
        {
          "sender": "received",
          "text": "Bet."
        }
      ]
    },
    {
      "id": "9gkr9j",
      "subreddit": "guns",
      "title": "You aren't suppose to ride the charging handle, but why? what does it break or does it not do?",
      "messages": [
        {
          "sender": "sent",
          "text": "I know that riding the charging handle is bad and you shouldn't do it. But why tho whenever I look at a bolt action rifle you can move the it as fast or as slow as you want. So why not for automati..."
        },
        {
          "sender": "received",
          "text": "We already have people who have answered the main question, but as a tidbit: &amp;#x200B; Supposedly, this is another side reason why the AR15 had the forward assist implemented. In case you need t..."
        },
        {
          "sender": "sent",
          "text": "Follow up question: can't you use your thumb to press the bolt forward instead of using the forward assist? The FA just seems like a \"make things worse\" button if your AR has a problem preventing t..."
        },
        {
          "sender": "received",
          "text": "I mean pushing the actual bolt forward through the ejection port, not the charging handle."
        },
        {
          "sender": "sent",
          "text": "Yes you can totally do this....as long as the bolt isn't hot AF and the chamber is decently free of debris."
        },
        {
          "sender": "received",
          "text": "The bolt needs to slam home, because it doesn't just go forward, it also rotates and locks into position. I doubt you could do that with your thumb through the ejection port. A solid lockup is impo..."
        },
        {
          "sender": "sent",
          "text": "I like to call it the \"jam enhancer\" 😁"
        },
        {
          "sender": "received",
          "text": "You can definitely do it with your thumb. I've done it a few times just to try it. No reason you should do it when you got the forward assist."
        },
        {
          "sender": "sent",
          "text": "Uh no. You can very easily seat the bolt on an AR15 by thumbing the carrier."
        },
        {
          "sender": "received",
          "text": "The cut out in the bolt carrier is for exactly this. The AR-15 wasn't originally designed with a forward assist, so the only way to close the bolt quietly was to press it closed with your thumb. Eu..."
        },
        {
          "sender": "sent",
          "text": "You have a source on this because as far as I know the cut out on the bolt was designed to open the dust cover."
        },
        {
          "sender": "received",
          "text": "Admittedly, I don't have a primary source for this, but it makes sense that the cutout would serve dual purposes. I really doubt Eugene Stoner never considered the possibility of having to push the..."
        },
        {
          "sender": "sent",
          "text": "Never heard it before, who else calls it that? I honestly don't follow many folks on youtube"
        }
      ]
    },
    {
      "id": "9grekv",
      "subreddit": "guns",
      "title": "After 7 years of searching and saving, allow me to introduce my brand new Gewehr 43. All matching.",
      "messages": [
        {
          "sender": "sent",
          "text": "I like shooting my 8mm Mauser (K98) but every time I do it’s like “Fuck you shoulder!” Still, what a great find!!"
        },
        {
          "sender": "received",
          "text": "In a rifle like this it's not as bad, I have a hakim in 8mm mauser and besides the fact Im out of shape and struggle shooting it while standing it's way more enjoyable."
        },
        {
          "sender": "sent",
          "text": "Now I can't wait to get mine."
        },
        {
          "sender": "received",
          "text": "I think 8mm Mauser is pretty tame compared to some rounds. For some reason .303 kicks me worse than a Kar98."
        },
        {
          "sender": "sent",
          "text": "Even a Vepr in 7.62x54r has less recoil than a mosin with no muzzle brake, and I don't agree that they are that loud. Yes they are still loud as hell but I'd be more worried about being in the way ..."
        },
        {
          "sender": "received",
          "text": "PPU ammo is going to be your best friend just an FYI, most surplus ammo I've tried out of mine has issues striking the primer hard enough even with a new hammer spring."
        },
        {
          "sender": "sent",
          "text": "Thanks for the heads up, have you ever use S&amp;B in yours, I can get that easier than I can get PPU. Edit: I'm just waiting for the seller to ship it to me."
        },
        {
          "sender": "received",
          "text": "I have not, however past experiences with other calibers of theirs has made me stay away from them. Had blown primers in 7.62x25 in 3 different guns out of several different lots so I haven't touch..."
        },
        {
          "sender": "sent",
          "text": "I use S&amp;B 9mm luger and 6.5x55 in my Ljungman and have had no issues with either"
        }
      ]
    },
    {
      "id": "9gubad",
      "subreddit": "guns",
      "title": "I love .40",
      "messages": [
        {
          "sender": "sent",
          "text": "40 is gay"
        },
        {
          "sender": "received",
          "text": "Yeah but so are you, so why don’t you shoot it? Have I ever told you if I shot production, I’d still use .40?"
        },
        {
          "sender": "sent",
          "text": "Yes you’ve shared that retarded thought. Do you shed a tear every time a police dept wakes up and switches to 9? Cause I get a throbbing erection each time we get one step closer to nobody using 40..."
        },
        {
          "sender": "received",
          "text": "No, it saves taxpayer money. .40 is only for R A C I NG"
        },
        {
          "sender": "sent",
          "text": "That’s exactly why it’s so gay, but I mean a beautiful round like 357 sig would be a great major power factor racing round."
        },
        {
          "sender": "received",
          "text": "9x25 is better. 357 sig is for Air Marshals and pussies"
        },
        {
          "sender": "sent",
          "text": "&gt;if I shot production, I’d still use .40 Then you could trigger everyone here, and everyone at matches too. It would be glorious."
        },
        {
          "sender": "received",
          "text": "&gt; 357 sig would be a great major power factor racing round Why would you use a bottleneck case if you didn’t have to?"
        },
        {
          "sender": "sent",
          "text": "Shitty memes"
        },
        {
          "sender": "received",
          "text": "How did I never know about 9x25? It’s so much better"
        },
        {
          "sender": "sent",
          "text": "You tell me"
        },
        {
          "sender": "received",
          "text": "A tanfoglio stock 2 in .40 is in my future"
        },
        {
          "sender": "sent",
          "text": "I'm gonna jump in and ask, what's wrong with bottleneck? Doesn't it feed better? I know it's a bitch to reload sometimes for me."
        },
        {
          "sender": "received",
          "text": "Normal straight walled pistol cases feed just fine, so I guess what is “better”? Because the case is overall just a wide as a .40, you still get the same capacity as a .40, but now you have to deal..."
        }
      ]
    },
    {
      "id": "9gvr7d",
      "subreddit": "guns",
      "title": "First Glock and first 10mm. Just in time for Best MM Tuesday.",
      "messages": [
        {
          "sender": "sent",
          "text": "I’ve been considering a 10 mm for EDC for a while now. I finally landed on a G29 gen4. Haven’t had a chance to shoot it yet but I hear great things."
        },
        {
          "sender": "received",
          "text": "Let us know how the recoil feels in this small platform!"
        },
        {
          "sender": "sent",
          "text": "A buddy of mine has one of these and I was very surprised at how manageable the recoil was. It honestly just felt like a hot 45. It's definitely on the short list for future toys for me"
        },
        {
          "sender": "received",
          "text": "Feels not bad at all with full power ammo. The report makes it sound and feel harsher than it actually is, especially to people standing next to you. Recoil is very mild for what it is."
        },
        {
          "sender": "sent",
          "text": "I really want a Kriss Vector in 10mm. Seems like the perfect combo for that form factor. But a compact handgun with my big mitts, no thanks."
        },
        {
          "sender": "received",
          "text": "How much did you get it for? I’m in the market for a 29 but I have no idea what people are paying for them."
        },
        {
          "sender": "sent",
          "text": "Honestly I paid way too much at a big box store. $600 before tax. I’ve seen them go for less than $500 on gun broker."
        },
        {
          "sender": "received",
          "text": "If it makes you feel any better, we have the same gripes on the other end of the hand-size scale lmao. 1911's are basically not usable for me... I dropped my uncle's twice and just went back to the..."
        },
        {
          "sender": "sent",
          "text": "&gt;Center Mass I love that place because it's the only one around where I can shoot full speed and not get kicked out."
        },
        {
          "sender": "received",
          "text": "10mm is an overrated round"
        }
      ]
    },
    {
      "id": "9gvy9s",
      "subreddit": "guns",
      "title": "My next project.",
      "messages": [
        {
          "sender": "sent",
          "text": "What did you pay for this girl?"
        },
        {
          "sender": "received",
          "text": "I won it on an auction site that brokers guns for $285. I figure for that price, I can fix it up and not mind shooting it."
        },
        {
          "sender": "sent",
          "text": "What site? That's a great deal"
        },
        {
          "sender": "received",
          "text": "A site that can't be linked to. But the site brokers guns. There's only one."
        },
        {
          "sender": "sent",
          "text": "It's a gun broker dotcom site. Shouldn't be hard to Google unless you're a complete moran."
        },
        {
          "sender": "received",
          "text": "&gt;moran Is this another \"BORTHER\" meme I'm missing out on or just an ironic typo?"
        },
        {
          "sender": "sent",
          "text": "Nice. I'm verrryyy late but I'm that adding to my meme memory once I get a brain. Thanks"
        },
        {
          "sender": "received",
          "text": "jesus, for that price you should do a hunnit dollar hydrodip to it for maximeme karma/trolling"
        },
        {
          "sender": "sent",
          "text": "HE'LL YEAH BORTHER"
        },
        {
          "sender": "received",
          "text": "How the fuck?"
        },
        {
          "sender": "sent",
          "text": "There is a lot more than one. I have a local estate consignment auction house with a FFL that always has good deals"
        },
        {
          "sender": "received",
          "text": "I get that there are more than one. But it's like the one. If it's that hard to understand I'm not sure what can be done. Plus it's clearly not a brick and mortar kind of place."
        }
      ]
    },
    {
      "id": "9h1xa6",
      "subreddit": "guns",
      "title": "Official Politics Thread 19 September 2018",
      "messages": [
        {
          "sender": "sent",
          "text": "Fire away!"
        },
        {
          "sender": "received",
          "text": "I got banned from a few days ago when I commented in the thread about CA and the NRA insurance deal. You can check my history to see what I said. The mods have given me no response to repeat reques..."
        },
        {
          "sender": "sent",
          "text": "Your fault for expecting reason from a default sub"
        },
        {
          "sender": "received",
          "text": "I got banned for pro-gun comments as well so now I use an alt to comment there."
        },
        {
          "sender": "sent",
          "text": "If you are progun then they consider your entire persona to be \"an agenda-pushing account\" and will ban you."
        },
        {
          "sender": "received",
          "text": "Speaks volumes."
        },
        {
          "sender": "sent",
          "text": "I was banned a year ago and still have yet to see a reason why. Good luck on that front, bud."
        },
        {
          "sender": "received",
          "text": "I just got banned from oldschoolcool without posting there ever but im used to it since I post in a \"controversial\" sub (they autobanned anyone from that weird feminist sub too). I still don't thin..."
        },
        {
          "sender": "sent",
          "text": "Shhhh... I have a positive karma pro-AR15 comment on and no ban... Only 2 karma though lol."
        },
        {
          "sender": "received",
          "text": "Same here. Commented (twice) on same story, got banned from , no mod response."
        },
        {
          "sender": "sent",
          "text": "Whoa... screen cap and save that shit. A rarity. Actually it reminds me of the few times that the astroturfed organizations didn't have marching orders (like the day after the election when they lo..."
        },
        {
          "sender": "received",
          "text": "From what I understand this is becoming an extremely regular thing - there's a few rabid anti-gun mods on that are banning anyone who is progun sort of under-the-radar. Any request for a response g..."
        },
        {
          "sender": "sent",
          "text": "Welcome to Reddit in 2018. This isn't the ran pual for pres place it used to be"
        }
      ]
    },
    {
      "id": "9h4pkm",
      "subreddit": "guns",
      "title": "What Should I Buy Wednesday 9/19/18",
      "messages": [
        {
          "sender": "sent",
          "text": "Sort by weight."
        },
        {
          "sender": "received",
          "text": "Say you have the hook up with someone that can get you all the 5.7 ammo you want. Is that even legal? Would you buy all the black tips you could?"
        },
        {
          "sender": "sent",
          "text": "SS190 doesn't meet the legal definition of \"armor piercing,\" there's no reason you couldn't buy as much as you want Only problem I could see is that whoever is selling it is likely getting it for f..."
        },
        {
          "sender": "received",
          "text": "&gt; Is that even legal? Is speeding? &gt; Would you buy all the black tips you could? No, of course not. Totally wouldn't hoard it and sell it on gb for $3/round."
        },
        {
          "sender": "sent",
          "text": "&gt; $3/round. Way to undercut the market, meanie"
        },
        {
          "sender": "received",
          "text": "That's the thing, I would be buying their \"old shit\" so they can buy \"new shit.\""
        },
        {
          "sender": "sent",
          "text": "I thought about selling it at a semi decent deal just to fuck everyone off online that's been doing that for years. I don't even have a fucking Five-seveN."
        },
        {
          "sender": "received",
          "text": "That is how having an exclusive supply is supposed to work. Sell it lower than everyone else until they give up and sell their stock, which you buy yourself, then jack the price up when the market ..."
        },
        {
          "sender": "sent",
          "text": "I'm sure there are a handful of guys on here that would make it worth your while."
        },
        {
          "sender": "received",
          "text": "What a slogging, thankless task you've thought up"
        },
        {
          "sender": "sent",
          "text": "I'd like to do it just to destroy those profiteers and profligates on gunbroker alone, making a little extra retro AR money don't hurt. I dunno if I should keep everyone posted here hehe."
        },
        {
          "sender": "received",
          "text": "Eh, that's a little bit sketchy. Just send me the contact info and I'll help him out instead. I don't want you to take the risk."
        }
      ]
    },
    {
      "id": "9h4vhu",
      "subreddit": "guns",
      "title": "The Trailer Park Trio",
      "messages": [
        {
          "sender": "sent",
          "text": "As my slide into crippling financial distress continues due to constant and everlasting home repairs/remodeling I managed to hideaway some schmeckles to continue my cheap gun 3-gun collection with ..."
        },
        {
          "sender": "received",
          "text": "It's remarkably tasteful for a budget collection."
        },
        {
          "sender": "sent",
          "text": "I love how unnecessary that gun looks. You could buy something completely different that would be objectively better for the same price but instead you build that thing. I love it."
        },
        {
          "sender": "received",
          "text": "Nvm. I misread costs. So many better options lol."
        },
        {
          "sender": "sent",
          "text": "Wouldn't a PSA AR-15 be more \"budget\" than an SU-16?"
        },
        {
          "sender": "received",
          "text": "Take a step down and look at the Hi-Point Carbine 995TS. Still an ugly gun, but nobody that has shot one says it's not fun. You could nit-pick little things wrong with it all day long, but at the e..."
        },
        {
          "sender": "sent",
          "text": "As someone who unironically turd-polishes an SD9VE, Maverick 88, and SU-16, hats fucking off. If you do end up going for an SU-16, I'd recommend Magpul's Zhukov over the Red Lion Precision Forend w..."
        },
        {
          "sender": "received",
          "text": "yes but lame answered here"
        },
        {
          "sender": "sent",
          "text": "what's wrong with maverick 88? I like mine for what it is"
        },
        {
          "sender": "received",
          "text": "I am really digging that forend, just not sure I want to spend $150 and still have to add a rail. Is it lighter than the factory forend?"
        },
        {
          "sender": "sent",
          "text": "Interesting gun collection, off topic though, MCARBO is the shit! Great company to spend your money with!"
        },
        {
          "sender": "received",
          "text": "I think your decision to go with the Sub2k makes sense for this project since it is similar in price to budget ARs but also fires 9x19 so it's cheaper overall to own. I was just thinking that SU ri..."
        },
        {
          "sender": "sent",
          "text": "Not cheap but the quality is inline with the price tag. Also the MWI mount is already $100 so for not much more you get something an order of mag less goofy and a slight comfort upgrade (to me). It..."
        },
        {
          "sender": "received",
          "text": "they used to be the cheaper option when they first came out. Now that I'm old(er) and no longer have to adapt to change, I refuse to adjust my world view despite having made a &lt;$500 AR myself"
        }
      ]
    },
    {
      "id": "9hadxg",
      "subreddit": "guns",
      "title": "9x19",
      "messages": [
        {
          "sender": "sent",
          "text": "Vectors &lt; Scorps"
        },
        {
          "sender": "received",
          "text": "I’m interested in hearing why, also why not from the people who downvoted you."
        },
        {
          "sender": "sent",
          "text": "IMO the scorpion looks so much better than the vector. Haven’t shot either so take that with a grain of salt, but by looks I think the scorpion is cleaner and looks “cooler”."
        },
        {
          "sender": "received",
          "text": "here here"
        },
        {
          "sender": "sent",
          "text": "The Vector's recoil mitigation system is thoroughly wasted on semi automatic."
        },
        {
          "sender": "received",
          "text": "Check out the video of the Trigger I have in it. It makes all the difference."
        },
        {
          "sender": "sent",
          "text": "Which trigger is this? Binary? Seems too fast."
        },
        {
          "sender": "received",
          "text": "Double Tap The bolt on the Vector doesn’t have as far to travel, so it’s a lot faster"
        },
        {
          "sender": "sent",
          "text": "I'll have to check out your video too. I shot both. Liked/bought the scorp, SBR stamped it, suppressed it, and it's my favorite out of my collection. The scorpion looks better IMO too, sleek. To ea..."
        },
        {
          "sender": "received",
          "text": "Found the trigger you mentioned. So basically, if it just has two positions, Fire or Safe, there’s no way to stop firing the weapon until the mag is empty? I mean, normally, that’s what I’d want. B..."
        },
        {
          "sender": "sent",
          "text": "Just don’t pull it again after the release and it stops. As the name suggest, it really double taps like crazy &amp; that’s where it shines. I went through a IDPA course just shredding it. 4 center..."
        }
      ]
    },
    {
      "id": "9hbg0x",
      "subreddit": "guns",
      "title": "Merry 9x19!",
      "messages": [
        {
          "sender": "sent",
          "text": "Holy shit nice AOW but since you got it last week i am betting it is illegal. Like you broke federal law illegal."
        },
        {
          "sender": "received",
          "text": "What's illegal about it?"
        },
        {
          "sender": "sent",
          "text": "No shit? That's wild, it came with the grip at a decent sized gun auction lol. I've read plenty about stocks/braces but I haven't seen anything about grips"
        },
        {
          "sender": "received",
          "text": "I have already said what was illegal about it. You have an AOW otherwise known as an Any Of Weapon. You have a vertical grip on a pistol and this is illegal. You don't have a rifle, a short barrele..."
        },
        {
          "sender": "sent",
          "text": "Appreciate it. You can have an angled grip but not vertical 😂 honestly I think it would feel more comfortable angled anyway"
        },
        {
          "sender": "received",
          "text": "Now you said what's illegal about it"
        },
        {
          "sender": "sent",
          "text": "Seeing that just made my night lmao"
        }
      ]
    },
    {
      "id": "9hf74w",
      "subreddit": "guns",
      "title": "9x19 day - As a hand engraver, I like to have things I personally own be an attention grabber and conversation starter. This pistol has gotten comments from”love it” and “shut up and take my money” to “throw that thing in the trash” to “now you have to chop your own d$&amp;k off”. Mission accomplished",
      "messages": [
        {
          "sender": "sent",
          "text": "Yeah, you probably should've cut down your massive title and put it down here as a description"
        },
        {
          "sender": "received",
          "text": "It's just this subreddit*, really. Most people title the way you do, but put some arbitrary comment in for a description Edited for typo"
        },
        {
          "sender": "sent",
          "text": "It looks at the length, iirc. You could post movie quotes without context and pass. I edited my other comment to fix a typo, but that bot is something I've only seen on this particular subreddit, o..."
        },
        {
          "sender": "received",
          "text": "It doesn't really know. You just need to have a top-level comment (meaning not a reply to another comment) above a minimum length."
        },
        {
          "sender": "sent",
          "text": "Or not. Nobody cares."
        },
        {
          "sender": "received",
          "text": "Yeah, I don't know exactly how long it needs to be, but I've seen some pretty short ones."
        },
        {
          "sender": "sent",
          "text": "Description: \"an elegant weapon, from a more civilized age\" 👌👍"
        },
        {
          "sender": "received",
          "text": "Ebay?"
        },
        {
          "sender": "sent",
          "text": "How did you do the engraving?"
        }
      ]
    },
    {
      "id": "9hg731",
      "subreddit": "guns",
      "title": "I like guns. How do I say that and not have my mental state questioned?",
      "messages": [
        {
          "sender": "sent",
          "text": "Basically, I wanna tell my therapist that watching gun disassembly videos are relaxing to me and drawing firearms is really fun and therapeutic for me. Should I say this during my appointment today..."
        },
        {
          "sender": "received",
          "text": "You enjoy learning about the historic and mechanical aspect of firearms. That's what I tell people who ask why I prefer milsurps over modern firearms."
        },
        {
          "sender": "sent",
          "text": "i get comments all the time from people who make accusations about my milsurp collecting. nobody i know seems to understand or appreiate the historical value, they basically changed the world."
        },
        {
          "sender": "received",
          "text": "So did washing machines."
        },
        {
          "sender": "sent",
          "text": "Well, now I need to start a new collection."
        },
        {
          "sender": "received",
          "text": "If you or anyone else is ever looking for an example that makes it easy for people to understand, firearm enthusiasts are almost totally analogous to car enthusiasts."
        },
        {
          "sender": "sent",
          "text": "No shit, I watched like a good morning America episode or something years back about a guy that had a washing machine collection. It was...actually kinda neat."
        },
        {
          "sender": "received",
          "text": "I know a guy with a cast iron bathtub collection. He uses them as flower pots though."
        },
        {
          "sender": "sent",
          "text": "So you're gonna be a Mormon then?"
        },
        {
          "sender": "received",
          "text": "Nah, ain't into indentured servitude."
        },
        {
          "sender": "sent",
          "text": "A lot of overlap, too - not that it matters."
        },
        {
          "sender": "received",
          "text": "Too right. Cars or guns, we don't tell our significant others just how much our hobby costs us."
        },
        {
          "sender": "sent",
          "text": "Fortunately, I'm just a gun enthusiast. My girlfriend, unfortunately for her purse, is both."
        },
        {
          "sender": "received",
          "text": "Thanks Uncle Lewis."
        }
      ]
    },
    {
      "id": "9hioof",
      "subreddit": "guns",
      "title": "Any bullpup fans out there?",
      "messages": [
        {
          "sender": "sent",
          "text": "My Tavor X-95, southpaw edition (although easy to convert) in 5.56 Trying to drum up some love for"
        },
        {
          "sender": "received",
          "text": "You got my sub good sir👍"
        },
        {
          "sender": "sent",
          "text": "Lol thanks, I'm not actually a mod, just a fellow bullpup fan trying to drum up a little interest in a very quiet sub."
        },
        {
          "sender": "received",
          "text": "You have succeeded in your quest"
        },
        {
          "sender": "sent",
          "text": "Yessss!!"
        },
        {
          "sender": "received",
          "text": "Only my dream rifle you got there. Nice! 👍"
        },
        {
          "sender": "sent",
          "text": "Thanks!"
        },
        {
          "sender": "received",
          "text": "&gt; although easy to convert Was a headache when I did one."
        },
        {
          "sender": "sent",
          "text": "and my axe"
        },
        {
          "sender": "received",
          "text": "Maybe a Shotgun-Axe combination of some sort."
        },
        {
          "sender": "sent",
          "text": "&gt; southpaw edition I was scratching my head wondering what was different about this, but clearly that's it."
        },
        {
          "sender": "received",
          "text": "Ive shot the 9mm version. How does the 5.56 compare?"
        },
        {
          "sender": "sent",
          "text": "I'm in."
        },
        {
          "sender": "received",
          "text": "I'm a Tavor X-95 guy myself, only right handed like Jesus and Chris Kyle."
        }
      ]
    },
    {
      "id": "9hm1f2",
      "subreddit": "guns",
      "title": "Official Politics Thread 21 September 2018",
      "messages": [
        {
          "sender": "sent",
          "text": "Take the demographic survey! Fire away!"
        },
        {
          "sender": "received",
          "text": "So how do we go about getting real freedom in the US again? California is about to sign through 8 new gun laws on top of the literal thousands they already have in the books and all 50 states have ..."
        },
        {
          "sender": "sent",
          "text": "I won't comment on President Trumps performance as a whole, but it is worth noting many voted for him for his choice in Supreme Court justices. So far we've got one confirmed and another on the way..."
        },
        {
          "sender": "received",
          "text": "Take more people shooting. Many anti's have never touched a gun, much less seen one in person. Change the minds of your peers. We are the future of this country, as terrifying as that seems."
        },
        {
          "sender": "sent",
          "text": "I'm going to repeat my comment from the last politics thread as it was posted very late but I am believing it to be more and more. Makes too much sense knowing how the Democrats work and how interc..."
        },
        {
          "sender": "received",
          "text": "I can't believe that people are saying this accuser doesn't need to come forward. It's the most asinine thing."
        },
        {
          "sender": "sent",
          "text": "Yes, the problem is so many people do not view the second amendment as their right because they never experienced it. They don't feel it's a right because they have never exercised it, due to the c..."
        },
        {
          "sender": "received",
          "text": "SCOTUS may get rid of some of the state level laws soon."
        },
        {
          "sender": "sent",
          "text": "He explicitly said that in 2016. I believe the quote is from one of his rallies and goes something like, \"Even if you don't like me, you'll still vote for me because of Supreme Court justices.\" He ..."
        },
        {
          "sender": "received",
          "text": "Due process is clearly not in vogue anymore."
        },
        {
          "sender": "sent",
          "text": "Being appointed by Trump seems to be a taint in of itself. He has a higher percentage of his cabinet that's been convicted of felonies than he has had appointments last his two short years in office."
        },
        {
          "sender": "received",
          "text": "She said he did it and that's all the proof anyone should need. Why are you a rape apologist?! DOX THIS SHITLORD"
        },
        {
          "sender": "sent",
          "text": "Hooray, we're back to lynch mobs."
        },
        {
          "sender": "received",
          "text": "/s for the uninitiated"
        },
        {
          "sender": "sent",
          "text": "Take the guns freedom first, go through due process second."
        }
      ]
    },
    {
      "id": "9hne1n",
      "subreddit": "guns",
      "title": "Ladies and gentlemen, the president of Croatia",
      "messages": [
        {
          "sender": "sent",
          "text": "And people were going crazy over Hillary...LOL!!! I doubt she has any trouble getting her people to follow her. Bright, Intelligent, and a looker. What else could you want. Certainly not shriveled ..."
        },
        {
          "sender": "received",
          "text": "Go away."
        },
        {
          "sender": "sent",
          "text": "Go back to Facebook, grandpa"
        },
        {
          "sender": "received",
          "text": "Christ."
        },
        {
          "sender": "sent",
          "text": "The water where you live might be tainted. Just a heads up"
        },
        {
          "sender": "received",
          "text": "It might be the same water that turns frogs gay."
        },
        {
          "sender": "sent",
          "text": "did u Kno that Hillary Clinton isn't president? Thought you should know that"
        },
        {
          "sender": "received",
          "text": "Bye Felicia"
        },
        {
          "sender": "sent",
          "text": "Banned / (permanent)."
        },
        {
          "sender": "received",
          "text": "Username kinda checks out lol"
        },
        {
          "sender": "sent",
          "text": "Understandable, have a nice day"
        },
        {
          "sender": "received",
          "text": "He'll be back"
        }
      ]
    },
    {
      "id": "9hzhru",
      "subreddit": "guns",
      "title": "Help With A Llama",
      "messages": [
        {
          "sender": "sent",
          "text": "Hey everyone, I just inherited a Stoeger Llama .380 yesterday and I was hoping someone can give me some info on my specific model. From the research I did last night, it seems these have been made ..."
        },
        {
          "sender": "received",
          "text": "I’d put it in the $350-400 range with the nickel plating. I’d buy it buy it for that anyway."
        },
        {
          "sender": "sent",
          "text": "Really? That's pretty awesome!"
        },
        {
          "sender": "received",
          "text": "Use gunbroker.com or Blue Book of Gun Values they’ll have a better idea if actual value. Gunbroker is a auction site so they tend to be inflated."
        },
        {
          "sender": "sent",
          "text": "He's about right, as long as it's functional."
        },
        {
          "sender": "received",
          "text": "Yeah, it shoots nice. It's stamped T1, that's 1975, right?"
        },
        {
          "sender": "sent",
          "text": "I believe so. I have a similar one in .32 from the 50's. Neat little guns, but they're not for everyone."
        },
        {
          "sender": "received",
          "text": "Any suggestions on where to sell it? I'm not looking for top dollar but, I don't want ripped off either."
        },
        {
          "sender": "sent",
          "text": "GunBroker, probably. You could take it to a gun shop, but I doubt they'd give more than $250-300 for it. If you do GunBroker, I'd set a reserve,or make the starting bid about $50 under the amount y..."
        },
        {
          "sender": "received",
          "text": "See if any gunshops in your area sell on consignment. I've sold many guns that way, and to me the 15% commission is worth not dealing with flaky people and lowball offers."
        },
        {
          "sender": "sent",
          "text": "Armslist is free and assuming you don’t live in a restrictive state you could just swap the gun for cash although it’s smart to get a bill of sale. However you need to be careful. There are a fuck ..."
        },
        {
          "sender": "received",
          "text": "You’re right about flakes, I’ve had reasonable success with armslist but for every good transaction I have someone show up a half hour late or start bitching about condition when I field stripped t..."
        }
      ]
    },
    {
      "id": "9i0nz1",
      "subreddit": "guns",
      "title": "Does this gun exist/design makes sense?",
      "messages": [
        {
          "sender": "sent",
          "text": "I'm writing a story and while I could just make up a design I want to know if it makes sense logical. A bolt action rifle firing 5.56 NATO (rather than a 7.62 for logical purposes) designed for mil..."
        },
        {
          "sender": "received",
          "text": "It’s possible, but it doesn’t make a lot of sense making a 5.56 bolt action. I think the benefits of using a self-loading rifle would outweigh the benefits of using a bolt-action."
        },
        {
          "sender": "sent",
          "text": "yes but earth specifically don't want to give the army they are building semi-automatic weapons, keeping that superior technology only for themselves while forcing them to be logistically reliant o..."
        },
        {
          "sender": "received",
          "text": "I’ll respond with another question: Why wouldn’t the army just use larger caliber bolt-actions to offset the HUGE amount of firepower they’re going to lose?"
        },
        {
          "sender": "sent",
          "text": "(heads up this is Sci-fi) Well given the army is jumping from swords, spears and bows to bolt action rifles I don't think they are going to care/know the difference."
        },
        {
          "sender": "received",
          "text": "Semi-auto weapons aren't that complex to make."
        },
        {
          "sender": "sent",
          "text": "oh geez okay that is a jump. However, it feels odd that the government would restrict semi-automatic weapons. Who uses them if the military cannot? Special agents? That would also mean most pistols..."
        },
        {
          "sender": "received",
          "text": "not when you are jumping a civilisation from the iron age/classical period. But I think we are getting off topic."
        },
        {
          "sender": "sent",
          "text": "Honestly, a better fit might be cheaply manufactured pistol calibre blow-back machine pistols like the Sterling machine gun. Suitable for a bunch of post-medieval shlubs to get in close and spray a..."
        },
        {
          "sender": "received",
          "text": "I'm guessing you're doing something like arming a medieval period army with more modern weapons right? If so, simple blowback 9mm carbine is a good answer. You can have it feed from a tube magazine..."
        },
        {
          "sender": "sent",
          "text": "&gt; However, it feels odd that the government would restrict semi-automatic weapons. Who uses them if the military cannot? Special agents? Earth (UN/fictional committee) has formed an alliance wit..."
        },
        {
          "sender": "received",
          "text": "You asked if it made sense. If earth has the technology to go to another planet (or dimension?) why would they be concerned about the tech jump from bolt to semi? That makes zero sense."
        },
        {
          "sender": "sent",
          "text": "Bolt-actions in this sense; of elevating a more primitive society; isn't an easier intermediate step. You're introducing a degree of metallurgy and machining that is almost identical in terms of ma..."
        },
        {
          "sender": "received",
          "text": "If they have modern materials and know of other guns they will make their own."
        }
      ]
    },
    {
      "id": "9i14et",
      "subreddit": "guns",
      "title": "Gunnit Rust: Summer Rust Contest Thread",
      "messages": [
        {
          "sender": "sent",
          "text": "THIS IS THE OFFICIAL CONTEST THREAD There will be many edits. Remember to post in the “Gunnit Rust: Your Title Here” format. Technically the contest day is Sunday the 23rd. YOU DIDNT HAVE TO SIGN U..."
        },
        {
          "sender": "received",
          "text": "Reminders / / /"
        },
        {
          "sender": "sent",
          "text": "/ / /"
        },
        {
          "sender": "received",
          "text": "/ / /"
        },
        {
          "sender": "sent",
          "text": "/ / /"
        },
        {
          "sender": "received",
          "text": "&gt; / &gt; / &gt; /"
        },
        {
          "sender": "sent",
          "text": "&gt; / &gt; / &gt; /"
        },
        {
          "sender": "received",
          "text": "&gt; / &gt; / &gt; /"
        },
        {
          "sender": "sent",
          "text": "&gt; / &gt; / &gt; /"
        },
        {
          "sender": "received",
          "text": "&gt; / &gt; / &gt; /"
        },
        {
          "sender": "sent",
          "text": "&gt; / &gt; / &gt; /"
        },
        {
          "sender": "received",
          "text": "&gt; / &gt; / &gt; /"
        },
        {
          "sender": "sent",
          "text": "&gt; / &gt; / &gt; /"
        },
        {
          "sender": "received",
          "text": "/ / /"
        },
        {
          "sender": "sent",
          "text": "/ / /"
        }
      ]
    },
    {
      "id": "9igw5t",
      "subreddit": "guns",
      "title": "How to protect ears from sound in shooting range?",
      "messages": [
        {
          "sender": "sent",
          "text": "Plugs and muffs together"
        },
        {
          "sender": "received",
          "text": "This is very informative:"
        },
        {
          "sender": "sent",
          "text": "Quit bein a freakin nerd and just do it hell if you want the real experience shoot without any protection,that’s true fun."
        },
        {
          "sender": "received",
          "text": "Stop being a sperg. Just double up"
        },
        {
          "sender": "sent",
          "text": "Judging from your comments, you’re a massive piece of shit. You’re calling people out for being mean and I just don’t see it in this thread, and yet you’re insulting and condescending to everyone. ..."
        },
        {
          "sender": "received",
          "text": "Yet, YOU came HERE, and asked US."
        }
      ]
    },
    {
      "id": "9inypx",
      "subreddit": "guns",
      "title": "Koch Slap",
      "messages": [
        {
          "sender": "sent",
          "text": "\\&gt;Shockwave on a .308 10/10 would not want to get hit by that on the collarbone"
        },
        {
          "sender": "received",
          "text": "I'm posting this from the hospital, which is where I live now."
        },
        {
          "sender": "sent",
          "text": "Have a Shockwave blade on a Mossberg 14\" 12 gauge firearm. It...sucks ass."
        },
        {
          "sender": "received",
          "text": "Pero por que? Why would you do that to yourself? At least get an SB M4 or something..."
        },
        {
          "sender": "sent",
          "text": "Idiocy mostly for me and my buddies to mess around with. Got an SBA3 on the way to replace it because I never shoot the thing anymore for obvious reasons haha."
        },
        {
          "sender": "received",
          "text": "In my experience the SBA3 is pretty great of a brace if you like the adjust-ability and it feels pretty much exactly like a carbine stock on an ar15 but the bottom rubber flexes and folds on itself..."
        },
        {
          "sender": "sent",
          "text": "Appreciate the insight. If I'm honest I just grabbed the A3 because two of my pistols already have those and they've been awesome. I'll definitely look into the others you mentioned, though. Never ..."
        },
        {
          "sender": "received",
          "text": "Tailhook Mod2 baybeeeeeeee Seriously, it's the best brace and totally-not-a-stock I've held pondered holding against me. It's pricy, but it comes with a buffer tube, castle nut, and end plate, so i..."
        },
        {
          "sender": "sent",
          "text": "I've messed with one of those as well. It's super solid, the latch on the SBA3 imo is just in a better position."
        },
        {
          "sender": "received",
          "text": "That is definitely true, the SBA3 is exactly like a stock in terms of actuation. That said, how often do you really need to adjust your length of pull? Between shooters, sure - but just you?"
        }
      ]
    },
    {
      "id": "9itqjy",
      "subreddit": "guns",
      "title": "Help! My father came to my house and took my handgun and ammo. What is my recourse?",
      "messages": [
        {
          "sender": "sent",
          "text": "&gt; I'm thinking that I should tell him that if he doesn't return it to me, I will be calling the police That's exactly what you should do. What he did was steal a firearm and that's a pretty seri..."
        },
        {
          "sender": "received",
          "text": "Call the cops. Tell them the whole story, get your mom on board with filing a report that discredits your dads story. Ask for a police escort to rexlaim your property. Also, you dont have to give h..."
        },
        {
          "sender": "sent",
          "text": "Isn’t there a way to report it stolen and then not press charges against the father?"
        },
        {
          "sender": "received",
          "text": "I think you hit the real issue on the head. I want it back but I don't want to press charges."
        },
        {
          "sender": "sent",
          "text": "Anyone who owns a gun is disgusting and is the reason for bad things in the world"
        },
        {
          "sender": "received",
          "text": "you can probably have the police go with you to get it and not press charges. Even if they arrest him, you should be able to drop charges afterward. I'm not a lawyer though. You need to act quickly..."
        },
        {
          "sender": "sent",
          "text": "Bye Felicia"
        },
        {
          "sender": "received",
          "text": "Banned / (permanent)."
        },
        {
          "sender": "sent",
          "text": "/ I think we have a troll."
        },
        {
          "sender": "received",
          "text": "Fuck off troll."
        },
        {
          "sender": "sent",
          "text": "People who make assumptions based on ownership of tools are disgusting and the reason for many bad things in this world."
        },
        {
          "sender": "received",
          "text": "peddle that shit somewhere else troll"
        }
      ]
    },
    {
      "id": "9iuj7e",
      "subreddit": "guns",
      "title": "Virgin French Clip vs. Chad American Clip.",
      "messages": [
        {
          "sender": "sent",
          "text": "How long before some dodo comes in here and unironically tries to correct the title and call it a magazine?"
        },
        {
          "sender": "received",
          "text": "This is exactly why the industry has moved towards the more inclusive, progressive term \"clipazine\""
        },
        {
          "sender": "sent",
          "text": "I'm here."
        },
        {
          "sender": "received",
          "text": "So, about 20 minutes."
        },
        {
          "sender": "sent",
          "text": "We were going to go with magiclip but that sounds like something you'd see advertisements for after 4am on a cable channel."
        },
        {
          "sender": "received",
          "text": "It’s just a Russian bot."
        },
        {
          "sender": "sent",
          "text": "&gt;So, about 20 minutes. How many is that in metric?"
        },
        {
          "sender": "received",
          "text": "Seriously though if I were a Russian bot that’d be the perfect cover."
        },
        {
          "sender": "sent",
          "text": "It's about Двадцать минут"
        },
        {
          "sender": "received",
          "text": "да I mean, probably correct."
        }
      ]
    },
    {
      "id": "9iwd8b",
      "subreddit": "guns",
      "title": "2 Stamp Tuesday CZ Scorpion",
      "messages": [
        {
          "sender": "sent",
          "text": "Whats the best way to go about getting an SBR Skorpion? Buy one in the pistol config and then put in for the stamp, then buy the stock?"
        },
        {
          "sender": "received",
          "text": "Yup, that’s the way I went."
        },
        {
          "sender": "sent",
          "text": "Yes pistol to SBR is easiest because a barrel swap is considerably more complicated than pushing one button for installing a stock. Also if you wanted to do a micro conversion the pistol is the bet..."
        },
        {
          "sender": "received",
          "text": "Buy and AR bodied pistol no stamp needed, then get one of those wrist straps. No stamp needed"
        },
        {
          "sender": "sent",
          "text": "I don't really want an AR9. They look wonky to me. And I've shot off a pistol brace before. Didn't thrill me."
        },
        {
          "sender": "received",
          "text": "Eww no not that, This:"
        },
        {
          "sender": "sent",
          "text": "Ah, gotcha. I specifically want something in 9mm for PCC matches, and so it can share the pistol suppression I eventually want to get. I live in the city, so my options for shooting anything other ..."
        },
        {
          "sender": "received",
          "text": "How long was the wait for the stamps? I'm guessing a long time, eh?"
        },
        {
          "sender": "sent",
          "text": "Right Under a year. I also had a small issue, had to email them some extra info. They both cleared on the same day."
        },
        {
          "sender": "received",
          "text": "Can also do that with this. I just like the stock. Also foregrips are nice."
        },
        {
          "sender": "sent",
          "text": "I agree. The magwell area just looks so wrong to me when a ar is chambered a pistol cartridge."
        },
        {
          "sender": "received",
          "text": "Those are nice, but the scorpion suppresses better."
        },
        {
          "sender": "sent",
          "text": "Wouldn't know. I've only shot my dad's ( 300 black out and not the sig one but similar) he's waiting on the suppressor."
        },
        {
          "sender": "received",
          "text": "I know, I just like that it's in rifle caliber"
        }
      ]
    },
    {
      "id": "9ixcoe",
      "subreddit": "guns",
      "title": "Which way does a revolver's chamber spin?",
      "messages": [
        {
          "sender": "sent",
          "text": "Hi, I'm an animator that knows nothing about guns, and I have been assigned the task of animating a scene in which a character spins the chamber of a revolver so that it is up to chance when he pul..."
        },
        {
          "sender": "received",
          "text": "They free spin either direction. When you are shooting one they spin clockwise. Hope that helps."
        },
        {
          "sender": "sent",
          "text": "Thank you! I didn't even to think of asking about when its fired, so you saved me an extra search!"
        },
        {
          "sender": "received",
          "text": "Glad I could help!"
        },
        {
          "sender": "sent",
          "text": "No. Some revolvers rotate clockwise. Some rotate counter clockwise."
        },
        {
          "sender": "received",
          "text": "Why are you thanking for an incorrect answer?!??????"
        },
        {
          "sender": "sent",
          "text": "Most people are saying it spins either way, or counter-clockwise. Which is correct? I know nothing about guns like I said before, sorry &amp;#x200B; Edit: And by spin I mean: The character loads, s..."
        },
        {
          "sender": "received",
          "text": "When the cylinder is open it spins freely either way. However, as a revolver cycles, it will only spin one way. Which way depends on the manufacturer."
        },
        {
          "sender": "sent",
          "text": "Maybe you are correct. All of my revolvers have rotated clockwise. I guess I can’t speak on all revolvers. Just all I have seen. Can you tell me which spin counter clockwise? Thanks for helping me ..."
        },
        {
          "sender": "received",
          "text": "There’s no maybe. Every brand has a different approach to lockwork."
        },
        {
          "sender": "sent",
          "text": "Mine revolves forward when I throw it."
        },
        {
          "sender": "received",
          "text": "Ok. I guess they do. As I stated, I can only speak on the ones I own or have messed with. I was only saying of all the revolvers I have handled, all have spun clockwise."
        },
        {
          "sender": "sent",
          "text": "Ok. Thanks for clearing that up. Like I said, I can only speak on mine. I just assumed all were the same. I will do more research. Thanks guys."
        }
      ]
    },
    {
      "id": "9iyj1p",
      "subreddit": "guns",
      "title": "[Experienced shooter, new to CCW] Is .38SPL sufficient or is .357 Mag the way to go when dailying a revolver?",
      "messages": [
        {
          "sender": "sent",
          "text": "I’ve been shooting long guns for most of my life and have had my NYS permit to carry a concealed weapon since I was 21 but for a variety of reasons I didn’t really feel like it was necessary so I d..."
        },
        {
          "sender": "received",
          "text": ".38sp +P is perfectly acceptable with proper JHP's like Speer gold dots, Hornady critical duty etc. Also there's no need to \"compete\" with 9mm, what you need is something you shoot accurately and q..."
        },
        {
          "sender": "sent",
          "text": "Thanks man."
        },
        {
          "sender": "received",
          "text": "I was tempted to say something sarcastic like “buy a Glock” but this is the absolute God’s honest truth. Carry what you shoot best, not what’s cool."
        },
        {
          "sender": "sent",
          "text": "Agreed 200%."
        },
        {
          "sender": "received",
          "text": "revolvers are great until you need more than 5-8 rounds."
        },
        {
          "sender": "sent",
          "text": "And everyone needs more rounds than that. Imagine being able to actually hit a target."
        },
        {
          "sender": "received",
          "text": "Glocks aren't \"cool\"."
        },
        {
          "sender": "sent",
          "text": "&gt; For a light weight carry revolver a .357 is often too much recoil for not enough extra velocity. Its cheaper and easier for me to just slam my hand in a car door repeatedly than to practice wi..."
        },
        {
          "sender": "received",
          "text": "Thanks, I was looking at steel revolvers because I’m concerned about the long term durability of alloys or polymers, seemed like most of the .38s I’m looking at are around 1 to 1 1/3 lbs whereas th..."
        },
        {
          "sender": "sent",
          "text": "Yeah it wasn’t very comfortable, my wrist felt like I had gotten into a bar fight with a brick wall after a 6 rounds of .357."
        },
        {
          "sender": "received",
          "text": "&gt; I’m definitely mostly interested in revolvers, although jamming isn’t as big of a problem with modern guns as it was years ago but it still can happen and that worries me, with a revolver you ..."
        },
        {
          "sender": "sent",
          "text": "Well yes, it’s not difficult to rack a slide, it wouldn’t really matter if I was just shooting soda bottles or a target or something, I’m thinking about that possibility arising when I’m in an actu..."
        },
        {
          "sender": "received",
          "text": "imagine fearing for your life and trying to shoot. imagine multiple targets. all things being equal, I'd rather have more rounds and faster reloads."
        }
      ]
    },
    {
      "id": "9iz9zv",
      "subreddit": "guns",
      "title": "Official Politics Thread 26 September 2018",
      "messages": [
        {
          "sender": "sent",
          "text": "Fire away!"
        },
        {
          "sender": "received",
          "text": "##Kavanaugh Confirmation Ford is scheduled to testify in front of the Judiciary Committee tomorrow morning followed by Kavanaugh. Senate Republicans have hired an outside counsel to ask the actual ..."
        },
        {
          "sender": "sent",
          "text": "FBI crime figures are out for 2017. Most murderous states: Louisiana 12.4 per 100,000 Missouri 9.8 per 100,000 Nevada 9.1 per 100,000 Maryland 9.0 per 100,000 Arkansas 8.6 per 100,000 Least murdero..."
        },
        {
          "sender": "received",
          "text": "We need to confirm Kavanaugh to have a chance at a real pro-gun majority. Everything so far as been politics as (un)usual. Also, still in the rumor mill BUT the 2nd accuser may have been caused by ..."
        },
        {
          "sender": "sent",
          "text": "We also have figures for homicides by weapon type. Handguns and \"firearms, type not stated\" were by far the most popular, with 7,032 and 3,096 murders respectively. There were 1,591 knife murders, ..."
        },
        {
          "sender": "received",
          "text": "I just don't understand what the end game for them is. They might derail Kavanaugh, but then what. If they take a majority in the senate in the midterms, which is unlikely due to the seats up for r..."
        },
        {
          "sender": "sent",
          "text": "I don't think delaying a SCOTUS confirmation has ever been a career killing move in the past. We've had some very delayed confirmations before."
        },
        {
          "sender": "received",
          "text": "&gt; I just don't understand what the end game for them is. Elected Democrats have two primary goals: 1) Demonstrate to their base that they were capable to escalating their opposition to Republica..."
        },
        {
          "sender": "sent",
          "text": "FWIW, Avenatti has denied that he was pranked. Whatever he brings out, it'll have to be a massive revelation to change the political calculus."
        },
        {
          "sender": "received",
          "text": "McConnel is still speaker, so yeah, no repercussions there at all."
        },
        {
          "sender": "sent",
          "text": "The Garland delay was like one third as long as the longest delay in history. There are plenty of SCOTUS confirmation delays in history that we can look at and see that major backlash isn't a parti..."
        },
        {
          "sender": "received",
          "text": "Speaker is a house position."
        },
        {
          "sender": "sent",
          "text": "&gt; Yes. At this point the activist base of the Democratic Party does not care. I really don't think that is the issue at play here. In the minds of Liberals, because I am one and I talk to those ..."
        },
        {
          "sender": "received",
          "text": "Well there's two pretty obvious reasons that New Hampshire and Louisiana have such disparate murder rates. It's nothing that gun grabbers could hear without literally shaking though."
        },
        {
          "sender": "sent",
          "text": "He didn't lock his Twitter, it was made private. You can still see his tweets if you follow him."
        }
      ]
    },
    {
      "id": "9j1s3z",
      "subreddit": "guns",
      "title": "What Should I Buy Wednesday 9/26/18",
      "messages": [
        {
          "sender": "sent",
          "text": "All done with weddings and the associated bachelor parties/money pits for the year, so maybe I'll be able to grab something before 2019. Sort by Country."
        },
        {
          "sender": "received",
          "text": "Build a .458 socom pistol. Because fuck engine blocks"
        },
        {
          "sender": "sent",
          "text": "An aero AR-10 build in .358 Win. is on the list."
        },
        {
          "sender": "received",
          "text": "What for?"
        },
        {
          "sender": "sent",
          "text": "Because I just think it would be awesome. Could use it on deer down the road up in NH or Maine, too."
        },
        {
          "sender": "received",
          "text": ".35 Rem on steroids?"
        },
        {
          "sender": "sent",
          "text": "Thats not a .458 socom."
        },
        {
          "sender": "received",
          "text": "Pretty much. 250 grains at 2300 fps in an autoloader."
        },
        {
          "sender": "sent",
          "text": "No, it's better. Like 500 more ft/lbs of muzzle energy, and flatter shooting."
        },
        {
          "sender": "received",
          "text": ".35 was king of the Model8/81 cartridges. Was an autoloader. That's Fuddtastic. Gonna do wood furniture?"
        },
        {
          "sender": "sent",
          "text": "Maybe down the line, but was just planning on regular shit for now. Need to buy the barrel soon just incase they stop being made, because they are probably not big sellers."
        },
        {
          "sender": "received",
          "text": "So a 450 grain socom bullet is less ridicous than a 250 grain win? Yea no"
        },
        {
          "sender": "sent",
          "text": "Thought they were 300 grain bullets for the standard load."
        },
        {
          "sender": "received",
          "text": "WOOD. Snag that barrel."
        },
        {
          "sender": "sent",
          "text": "KAK has them for $250. 12.5\"/16\"/19\" for options. Probably go 19."
        }
      ]
    },
    {
      "id": "9j4xby",
      "subreddit": "guns",
      "title": "Not the poor man's SCAR 16 any longer",
      "messages": [
        {
          "sender": "sent",
          "text": "I’d take the 805 or the Bren 2s any day over the SCAR..."
        },
        {
          "sender": "received",
          "text": "Most people would. Even people who own SCARs aren't shy about saying the 16S is overpriced for what it is. The real value proposition is the 17S."
        },
        {
          "sender": "sent",
          "text": "The Scar has a lot of merit but FN has been sitting on it for to long. A scar with Mlok, non reciprocating charging handle and some more caliber and barrel options would bring it back to the top im..."
        },
        {
          "sender": "received",
          "text": "FN has had the non reciprocating ones for a while now. Shot one close to 5 years ago I think. Its weird they refuse to bring it to the market."
        },
        {
          "sender": "sent",
          "text": "Even then, I’ve heard a lot of people say that you can make a very competitive AR10 for much less than what a 17 would go for. However I don’t have experience with either platforms, it’s just somet..."
        },
        {
          "sender": "received",
          "text": "I honestly didn’t like the SCAR at all! My biggest complain? The reciprocating bolt! I made the one I shot jam several times! I have not had the pleasure of shooting the Bren 2s, I spent several ra..."
        },
        {
          "sender": "sent",
          "text": "Rental ranges are our friends. I make my annual pilgrimage to a rental range to shoot all kinds of goodies."
        },
        {
          "sender": "received",
          "text": "I'm almost convinced that thing isn't gonna be released considering how long it has been. Maybe FN doesn't want it's consumers using Autosnipers or something."
        },
        {
          "sender": "sent",
          "text": "If you’re serious, why would they object to consumers using a SCAR derivative when they openly sell the SCAR?"
        },
        {
          "sender": "received",
          "text": "it was a counter-strike joke, not srs"
        },
        {
          "sender": "sent",
          "text": "Not to get into the weeds, it would be competitive but still lack features the SCAR has just due to the nature of the AR platform. The closest you can get imo is the LMT MRP, and that'll be heavier."
        },
        {
          "sender": "received",
          "text": "not really though, you can get side-charging non-reciprocating AR uppers for a reasonable price. The big cost is if you really want to get a piston gun."
        },
        {
          "sender": "sent",
          "text": "And they still won't be monolithic or have the weight or shoot as softly or have a functional folding stock. Believe me bud if it existed I'd own it. AR-18 variants simply overcome the shortcomings..."
        }
      ]
    },
    {
      "id": "9j9fps",
      "subreddit": "guns",
      "title": "FN P90 with Giggle Switch.",
      "messages": [
        {
          "sender": "sent",
          "text": "The only reason I wish the ‘86 ban was lifted."
        },
        {
          "sender": "received",
          "text": "I don't know about \"only\", but I can agree damn shame none of these are transferable if I had the disposable income to blow."
        },
        {
          "sender": "sent",
          "text": "Only might be an overstatement, but it’s the only gun that being fully automatic is the difference between me actually buying one or not. I’d buy a semi AR/AK/etc, very unlikely I’ll ever pick up a..."
        },
        {
          "sender": "received",
          "text": "Okay, I see where you're coming from. But, I just think you should know that this was every bit as great as you've imagined. I've shot full-auto M4s and M16s, M249s, M240Bs, and even M2s. I love my..."
        },
        {
          "sender": "sent",
          "text": "I know exactly what you mean. For me it's an MP5."
        },
        {
          "sender": "received",
          "text": "‘86 ban should be lifted regardless. Last time I saw the 2nd amendment wasn’t ratified and it still says “SHALL NOT BE INFRINGED”."
        },
        {
          "sender": "sent",
          "text": "I was just looking at sear packs last night $45,000 MP5 sear pack orrr a brand new taco truck. 🤔"
        },
        {
          "sender": "received",
          "text": "Sear pack will probably go up in value"
        },
        {
          "sender": "sent",
          "text": "FA p90 with a small suppressor. &lt;3"
        },
        {
          "sender": "received",
          "text": "I wish you best of luck with your decision-making."
        },
        {
          "sender": "sent",
          "text": "Yes, let’s let anyone own any weapon ever 🙄"
        },
        {
          "sender": "received",
          "text": "Yep, without getting into a huge debate. That’s the whole point of the second amendment. I would implore you read the federalist papers as well."
        },
        {
          "sender": "sent",
          "text": "To the fabrication shop we go! s/"
        }
      ]
    },
    {
      "id": "9jclak",
      "subreddit": "guns",
      "title": "Winchester vs. Henry Repeaters?",
      "messages": [
        {
          "sender": "sent",
          "text": "Is there a noticeable quality or option(s) difference between Winchester and Henry Repeaters or is it just paying more for the name? Winchesters seem to be a bit higher priced on a few sites I look..."
        },
        {
          "sender": "received",
          "text": "Henrys aren't bad but I do think the Winchesters are better. The Winchesters are still based on the original designs, the 1873, 1876, 1892, 1894, and 1895. Henrys are a modern design. If that makes..."
        },
        {
          "sender": "sent",
          "text": "That helps a lot. Thanks much!"
        },
        {
          "sender": "received",
          "text": "Also Henry has a new box magazine fed lever, the Long Ranger that you can get in .308win/.243win full power spitzer cartridges."
        },
        {
          "sender": "sent",
          "text": "Just for the sake of comparison, the Win 95 is capable of this. So is the Savage 99, which doesn't usually get talked about as a Western gun but it's been around as long as the Browning Winchesters."
        },
        {
          "sender": "received",
          "text": "Savage discontinued the 99 recently and the 95 had been out of production for a long time. Browning and Henry are the only two names in current production spitzer levers."
        },
        {
          "sender": "sent",
          "text": "This is true. Neither of them are unobtainium though. Early 95s are tough but winchester did have a modern production run."
        },
        {
          "sender": "received",
          "text": "I forgot the Win. 1886 too, which is beefy rifle caliber gun. Also pricey."
        },
        {
          "sender": "sent",
          "text": "The BLR and Henry are also simpler. IMO better guns."
        },
        {
          "sender": "received",
          "text": "Yeah, the 95 is a cluster. 99s aren't bad though, other than the magazine but you dont normally need to mess with it. It's a tilting bolt striker fired gun. There's like 8 pieces in one."
        },
        {
          "sender": "sent",
          "text": "Get a Marlin..and when I say get a Marlin I mean a true Marlin with the JM stamp on the barrel and made in North Haven CT. You can go on gunbroker and search \"JM Marlin\" for some easy finds. I'd go..."
        }
      ]
    },
    {
      "id": "9jcuan",
      "subreddit": "guns",
      "title": "What's better than 1 soldier shooting fron a shitty barrier? 4 soldiers shooting from a shitty barrier!",
      "messages": [
        {
          "sender": "sent",
          "text": "That is dumb, why are they wasting ammo trying to train like that? You would never fight like that in combat, one grenade and they are all dead or injured. I really hope this is a joke and they are..."
        },
        {
          "sender": "received",
          "text": "Would you ever have to be shooting like this in combat? Probably not, but war is unpredictable. The real thing is that it allows for four soldiers to be shooting all at once, as opposed to just one..."
        },
        {
          "sender": "sent",
          "text": "Been to war Army Cav Scout 2006-2012, deployments to Iraq and Afghanistan."
        },
        {
          "sender": "received",
          "text": "My cap's off to you."
        },
        {
          "sender": "sent",
          "text": "And this is so much better?"
        },
        {
          "sender": "received",
          "text": "I shouldn't been so rude, my fault. You do fight how you train, and have seen bad training get people hurt and killed. I will give you advice that you didn't ask for, if you plan on getting out mak..."
        },
        {
          "sender": "sent",
          "text": "I mean its practice shooting from cramped uncomfortable positions, with other rifles being fired right next to their ears and getting hit with brass. I'm not a professional trigger puller so that's..."
        },
        {
          "sender": "received",
          "text": "I'm already an officer, so I know the wonders of the army paying for school. Hopefully some E-3 sees your comment and gets smart about schooling."
        },
        {
          "sender": "sent",
          "text": "I think this might have been a talking guns drill? Weird how they put all their dicks on other peoples butts, but I don't judge. After watching this a few times, no idea what the fuck they are doin..."
        },
        {
          "sender": "received",
          "text": "Hell yeah brother, cheers from Iraq."
        },
        {
          "sender": "sent",
          "text": "Stay safe out there, earning those gold spurs!"
        },
        {
          "sender": "received",
          "text": "The memes are leaking"
        },
        {
          "sender": "sent",
          "text": "Can I use it to buy more crayons?"
        }
      ]
    },
    {
      "id": "9jhmvp",
      "subreddit": "guns",
      "title": "New gun owner.. any pro tips?",
      "messages": [
        {
          "sender": "sent",
          "text": "Don't store your guns in cases, they will rust. Get a stack on cabinet or safe. Or just stick them in the closet."
        },
        {
          "sender": "received",
          "text": "Maybe. If there's foam in it that's what causes the rust. It holds moisture against the metal."
        },
        {
          "sender": "sent",
          "text": "Foam and cloth collects moisture and causes rust. Oil your guns 2x a year and give them a wipe down with a lightly oiled rag after shooting. I live by the beach, only thing I do is oil my guns and ..."
        },
        {
          "sender": "received",
          "text": "You want to get a very light coat of oil on all the metal surfaces. It’s best to re-oil them after shooting since you probably wiped a lot of oil off plus your fingerprints can cause rust. You do n..."
        },
        {
          "sender": "sent",
          "text": "Exactly, I’m a bit paranoid and probably oil my guns a bit more than I need to but it’s better than running them dry or letting them rust. I live in a marine climate and have some older guns with a..."
        }
      ]
    },
    {
      "id": "9jjqud",
      "subreddit": "guns",
      "title": "Official Politics Thread 28 September 2018",
      "messages": [
        {
          "sender": "sent",
          "text": "Fire away!"
        },
        {
          "sender": "received",
          "text": "SHALL NOT BE INFRINGED No but really, did anyone see the veto in California?"
        },
        {
          "sender": "sent",
          "text": "CA info (courtesy /): Bills he vetoed: AB 1927, which would have allowed state citizens to voluntarily give up their gun rights. AB 2888, a red flag law that would have allowed employers, coworkers..."
        },
        {
          "sender": "received",
          "text": "&gt;Expands the 1 in 30 handgun rationing to include long guns Cue the panic buying. Man, I'm gonna blow so much money panic buying guns at overinflated prices. RIP my wallet."
        },
        {
          "sender": "sent",
          "text": "&gt; AB 1927, which would have allowed state citizens to voluntarily give up their gun rights. Huh, what's the reasoning behind opposing or vetoing this?"
        },
        {
          "sender": "received",
          "text": "So AB 746 sounds like it’s targeted to guns made out of 80% lowers/frames?"
        },
        {
          "sender": "sent",
          "text": "Here's his veto statement (PDF Warning). It was just a bill to study making such a law, it wasn't actually a bill to make a law."
        },
        {
          "sender": "received",
          "text": "Targeted at, but happens to hit curio/relic firearms in the blast radius."
        },
        {
          "sender": "sent",
          "text": "The stupid thing about the 1 in 30 restriction is that one of the exceptions included is anyone with an FFL03 and a CA Certificate of Eligibility, which together require under $150 for fees and fin..."
        },
        {
          "sender": "received",
          "text": "I guess if there's one state where people can afford to buy multiple guns every month, it's California... Edit: is sarcasm. Making fun of their stupid high taxes"
        },
        {
          "sender": "sent",
          "text": "Hadn’t even considered that. Always forget that there are old guns that came from the factory without a serial number."
        },
        {
          "sender": "received",
          "text": "Because it's stupid? And studying making that law would be an incredible waste?"
        },
        {
          "sender": "sent",
          "text": "Shit, good point. I was so caught up in the 80% talking points that I totally missed how it mandates vandalizing antiques."
        },
        {
          "sender": "received",
          "text": "Looks like the min age raising bill was signed. However the rationing bill, the gun show bill, and the buyback bill were all vetoed."
        },
        {
          "sender": "sent",
          "text": "&gt;AB 1927, which would have allowed state citizens to voluntarily give up their gun rights. How does this even work?"
        }
      ]
    },
    {
      "id": "9jpawn",
      "subreddit": "guns",
      "title": "Does anyone actually use semi-auto rifles?",
      "messages": [
        {
          "sender": "sent",
          "text": "This may seem like a dumb question but I’m no gun or military expert. Just a guy who plays a lot of games. Basically I’m just curious if any military or hunter people actually use semi-auto rifles...."
        },
        {
          "sender": "received",
          "text": "The guy who shot Bin Laden said he never once switched his rifle to Auto in his 400+ missions. Military rifles have an automatic setting, but in the west soldiers very rarely use it. Squads have ma..."
        },
        {
          "sender": "sent",
          "text": "Wait that switch is a real thing? I honestly thought that was a video game mechanic. Welp, this shows my knowledge on that"
        },
        {
          "sender": "received",
          "text": "Well... yeah. How did you think people switched from safe to fire? Are you very young or something?"
        },
        {
          "sender": "sent",
          "text": "Well I knew that safe mode was a thing, that’s as simple as locking the trigger. I just can’t really think how something could switch between auto and semi. I don’t understand how that works mechan..."
        },
        {
          "sender": "received",
          "text": "On the M16 family the safety will disengage the disconnector in full auto mode. Some will have a complicated ratchet mechanism that will return the disconnector after three rounds. When the disconn..."
        },
        {
          "sender": "sent",
          "text": "Oooooh I see, so it’s just a configuring how the safety goes"
        },
        {
          "sender": "received",
          "text": "The solution is to throw away everything you think you know about firearms and lurk here for a while. There is an FAQ in the sidebar, you should read it."
        },
        {
          "sender": "sent",
          "text": "Right. So on the M16a2 the typical arrangement was safe, Semi, Burst. Cams on the safety engage different parts of the fire control group."
        },
        {
          "sender": "received",
          "text": "Well, it might be better to think of the \"safety\" as a \"selector lever\". It has three positions on a fully auto M4, for example: Safe, Semi and Auto. So you use the \"selector lever\" to \"select\" whi..."
        },
        {
          "sender": "sent",
          "text": "/thread"
        },
        {
          "sender": "received",
          "text": "This video will teach you everything about how firearms work."
        }
      ]
    },
    {
      "id": "9jrw3i",
      "subreddit": "guns",
      "title": "When a Carcano and a Arisaka love each other very much......",
      "messages": [
        {
          "sender": "sent",
          "text": "Any tips on a website I can use to research an Arisaka I inherited from my grandfather? He picked it up on Iwo, but I don't know anything about it other than that."
        },
        {
          "sender": "received",
          "text": "As far markings and such goes;If it's a Type 38, CandArsenal has a really good video on it,although it's over an hour long and should have a link to a book If it's a Type 99,I dont know of the top ..."
        },
        {
          "sender": "sent",
          "text": "I believe it's the type 99 as it has the crysanthemum. However, that's all I know."
        },
        {
          "sender": "received",
          "text": "Just because it has a chrysanthemum does not actually mean its specifically mean it's a Type 99,all of Japan's rifles(Minus the Type I)had a chrysanthemum on it,chances are since he picked it up on..."
        },
        {
          "sender": "sent",
          "text": "The rifle is currently at my parents home in a different city, I'll upload pics as soon as I can. What pictures would be most beneficial to help in identification? I don't believe my grandfather ki..."
        },
        {
          "sender": "received",
          "text": "The bolt,the stock and sights, the muzzle with something like a .30-06 down (as if you checking for counter-boring),and the top of the receiver. While that does make it less likely that he killed t..."
        },
        {
          "sender": "sent",
          "text": "He was an amazing man. Dr. Jack Hough out of Oklahoma City if you'd like to look him up. He passed a number of years ago, but is one of the most amazing people I've ever met. I'll try to get pictur..."
        },
        {
          "sender": "received",
          "text": "I did a little digging this morning and might have found a website that would help a little at giving you an idea of what and where it is,if you ever get the rifle to sit down and research with : I..."
        },
        {
          "sender": "sent",
          "text": "The markings on that website are accurate and have been used and checked by advanced collectors for years with confidence. No need to be wary. Also, some carification on ground mums: Ground mums US..."
        },
        {
          "sender": "received",
          "text": "That makes sense,when it comes to any type of conversion process not every single rifle,pistol,or otherwise is going to affected;especially when considering the millions of rifles that Japan or oth..."
        },
        {
          "sender": "sent",
          "text": "No worries. I own several Type 99 Japanese rifles, but am not an advanced collector. I have been reading up and studying the stories on these for years though. I have been looking at Arisakas at gu..."
        }
      ]
    },
    {
      "id": "9ju5t8",
      "subreddit": "guns",
      "title": "Had to sell all my toys aside from my loyal Mossberg 500 to stay afloat when I started a new business and deal with very serious medical issues. Here’s to making a comeback!",
      "messages": [
        {
          "sender": "sent",
          "text": "Just a note, most commercial first aid kits suck for anything major. Make sure to stick in some supplies for medium and major emergencies too"
        },
        {
          "sender": "received",
          "text": "Absolutely. Also throwing in some pain meds and I plan on taking a first aid class to become more “useful”. Mainly bought this kit on Amazon because I thought it reminded me of the video game Left ..."
        },
        {
          "sender": "sent",
          "text": "Can you recommend anything for medium or major emergencies? Maybe something someone could use for backpacking?"
        },
        {
          "sender": "received",
          "text": "Tourniquets are your best friend for gun shot wounds to legs or arms. Spend a little and get a few. Quick clot gauze are good for packing a wound and chest seal for a wound to the lungs. And then y..."
        },
        {
          "sender": "sent",
          "text": "This kit is about as compact as it gets for treating gunshot wounds. I have a larger kit from the same vendor for my range bag."
        },
        {
          "sender": "received",
          "text": "Quick clot, and compression bandages are always good. I always have both in my go bag."
        },
        {
          "sender": "sent",
          "text": "It goes great with your COD loadout! I kid, I kid. That DD is sexy af."
        },
        {
          "sender": "received",
          "text": "What's pretty standard among SAR for spints is the SAM splint. It's foam covering a bendable aluminum backing that can be shaped to stabilize different fractures including a neck brace if one knows..."
        },
        {
          "sender": "sent",
          "text": "I thought inexperienced users should not carry tourniquets? Something about nerve damage I think?"
        },
        {
          "sender": "received",
          "text": "Better than dying from blood loss"
        },
        {
          "sender": "sent",
          "text": "Had a training with a local pd and they said the stigma on them is kind of antiquated. And if you think about it, you put it on a healthy arm and the arm gets red and tight from the fullness-of blo..."
        },
        {
          "sender": "received",
          "text": "Hahaha it really do"
        },
        {
          "sender": "sent",
          "text": "Are you saying put the tourniquet on the hole?"
        },
        {
          "sender": "received",
          "text": "Dark Angel Medical is a good place to read/learn/purchase solid med stuff. Tourniquets be very careful where you buy since there's a lot of counterfeits out there. Do your research first!"
        }
      ]
    },
    {
      "id": "9jylij",
      "subreddit": "guns",
      "title": "Mama mia that's a good gun",
      "messages": [
        {
          "sender": "sent",
          "text": "I personally hate them. The grip is to big, it's heavy, and I don't like the sights. Anything over 25 meters is obscured by the front sight. The trigger weight is horrendous on double action at 13l..."
        },
        {
          "sender": "received",
          "text": "Everybody has their own feel, so to each their own.... but you still earn my downvote :)"
        },
        {
          "sender": "sent",
          "text": "I personally love them. I can hold a basketball with one hand. I have big hands so they fit perfectly to me. Heavy? No, it is 1 lbs underweight. 4 lbs total weight would be perfect. A 35 rounds mag..."
        },
        {
          "sender": "received",
          "text": "\"the factory sights suck on the 92, I prefer Glocks whose factory sights also suck\""
        },
        {
          "sender": "sent",
          "text": "I think SOF units and the rangers might disagree, seeing as how we actually used the beretta overseas and hated it, then adopted glock and love it. But hey, must be fanboys am I right? Never mind h..."
        },
        {
          "sender": "received",
          "text": "I said they suck, why I put after market sights on mine."
        },
        {
          "sender": "sent",
          "text": "And why couldn't you put aftermarket sights on the 92? They're not as common, but readily available from berretas website."
        },
        {
          "sender": "received",
          "text": "Dude, you must be like 5ft and 100lbs soaking wet then. Even my little sister could shoot our dad's Bretta 92 with no trouble."
        },
        {
          "sender": "sent",
          "text": "It's a beretta 92, if you dont think there is plethora of aftermarket support for this firearm, then you have lost your god damn mind. Fucking glocktard fanboys kill me with this shit."
        }
      ]
    },
    {
      "id": "9k24o4",
      "subreddit": "guns",
      "title": "Found these in a pawn shop, box of 20. Now I’ll need a 10MM.",
      "messages": [
        {
          "sender": "sent",
          "text": "Priced at $70. Offered the shopkeep $45 and he took it literally so it was 42.something with tax $45. Before these I’ve never seen a box of black talons and figured it would be nice to have. I know..."
        },
        {
          "sender": "received",
          "text": "You “just don’t think these mushroom the same way?” You realize there are actually better projectiles now? That these just have magic streetfuddlore attached to them? Cool find and all, but the dif..."
        },
        {
          "sender": "sent",
          "text": "Oh yes. I just bought to have as part of my collection. You don’t see these often. I’d carry HSTs over black talons any day. I’ve seen the T-series but they’ve never caught my eye like the talons."
        },
        {
          "sender": "received",
          "text": "I’m not spouting anything. I just like the black talons since they are something that not everyone sees regularly and won’t be made again. I find that pretty cool. I know there’s much better rounds..."
        },
        {
          "sender": "sent",
          "text": "Ranger SXT was the rebranded Black Talon actually not PDX. Joke was SXT Same eXact Thing"
        },
        {
          "sender": "received",
          "text": "Next you'll say ratshot isn't effective"
        },
        {
          "sender": "sent",
          "text": "At least you got the self awareness tho"
        }
      ]
    },
    {
      "id": "9k7974",
      "subreddit": "guns",
      "title": "Razor amg",
      "messages": [
        {
          "sender": "sent",
          "text": "Put this new vortex razor amg holographic red dot on my scorpion evo. Love the way it looks and functions"
        },
        {
          "sender": "received",
          "text": "Man, I've said this before but I hope they do a version two of the UH1 because god that bulk looks ridiculous on small guns."
        },
        {
          "sender": "sent",
          "text": "Does the safety bother you as much as it bothers me? Just digs into my hand..."
        },
        {
          "sender": "received",
          "text": "i hear theres replacements for it"
        },
        {
          "sender": "sent",
          "text": "I put the safety delete on but yes it was bad before"
        },
        {
          "sender": "received",
          "text": "There are safety delete options, and changing the grip. Personally getting the yeti wurks grip solved the safety issue for me."
        },
        {
          "sender": "sent",
          "text": "Then get one of vortex's many other red dot options..."
        },
        {
          "sender": "received",
          "text": "It does look massive, but it is the same size of an eotech holosight. The only difference is that the hood covers all of the optic on the vortex so it makes it look much larger"
        },
        {
          "sender": "sent",
          "text": "Is it? I don't recall seeing them side by side in a comparison."
        },
        {
          "sender": "received",
          "text": "Yes, GarandThumb on youtube does a side-by-side as part of his interview for the Vortex. Look it up."
        },
        {
          "sender": "sent",
          "text": "To anybody thinking of buying this gun, I’ve seen this comment all over reddit. 1000rds through the gun and it hasn’t bothered me once."
        }
      ]
    }
  ]
}